export const PERSONALITY_RESULTS = {
  ISTJ: {
    title: 'ISTJ',
    type: 'マグロ',
    image: '/sushi/ISTJ.png',
    compatibleType: [
      {
        title: 'ESFJ',
        type: 'サーモン',
        image: '/sushi/ESFJ.png',
        combination: '信頼性のデュオ',
        remark: '安定性と規律を追求',
        description:
          'サーモン型とマグロ型の組み合わせは、共に高い信頼性と規律を持つため、非常に安定した関係を築くことができます。',
      },
      {
        title: 'ISFP',
        type: 'イクラ',
        image: '/sushi/ISFP.png',
        combination: '現実的なペア',
        remark: '現実と誠実さを共有',
        description:
          '現実的で実用的なイクラ型と誠実なマグロ型は、お互いの現実感と誠実さを理解し、尊重することができます。',
      },
      {
        title: 'ENTJ',
        type: 'ウニ',
        image: '/sushi/ENTJ.png',
        combination: '指導と実行のバランス',
        remark: '理論と行動を一緒に',
        description:
          'リーダーシップを持つウニ型と行動的なマグロ型は、理論と行動を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'INFP',
        type: 'タコ',
        image: '/sushi/INFP.png',
        combination: '想像力と現実感のペア',
        remark: '夢と現実を共有',
        description:
          '想像力豊かなタコ型と現実的なマグロ型は、お互いに夢と現実を理解し、共有することができる関係性です。',
      },
      {
        title: 'ENFJ',
        type: 'アナゴ',
        image: '/sushi/ENFJ.png',
        combination: '理解と努力の連携',
        remark: '理論と具体性を組み合わせて',
        description:
          '感情に対する深い理解を持つアナゴ型と誠実で努力家のマグロ型は、相手の感情を理解し、具体的なアクションに変換することができる組み合わせです。',
      },
      {
        title: 'ISTP',
        type: 'サバ',
        image: '/sushi/ISTP.png',
        combination: '具体的な行動のペア',
        remark: '現実と詳細を共有',
        description:
          '詳細に対する敏感さを持つサバ型と現実的なマグロ型は、具体的な行動と現実の詳細において共通点を持つことができます。',
      },
      {
        title: 'ESTP',
        type: 'カニ',
        image: '/sushi/ESTP.png',
        combination: '動的で現実的なペア',
        remark: '行動と規律を一緒に',
        description:
          '行動的なカニ型と規律正しいマグロ型は、お互いの行動と規律を理解し、尊重することができます。',
      },
      {
        title: 'INFJ',
        type: 'ハマチ',
        image: '/sushi/INFJ.png',
        combination: '理論と具体性のバランス',
        remark: 'ビジョンと行動を共有',
        description:
          'ビジョナリーなハマチ型と行動的なマグロ型は、ビジョンと具体的な行動を組み合わせた関係性を築くことができます。',
      },
    ],
    basicPersonality: `
    マグロ型の人は、大切な考え方や価値観をしっかり持っていることがよくあります。それは、きちんとルールを守ったり、決められた手順を大切にしたりするからです。 <br><br> 
    彼らは世界を論理的に、そして客観的に見ることが得意です。これにより、事実だけに基づいて物事を判断することができます。さらに、彼らの決定は自分の経験や直感によって作られます。 <br><br> 
    <h2>学習力と問題解決力の秘訣</h2> マグロ型の人は、具体的な事実や細部に注目することが好きで、過去の経験から学んだことを今と未来の問題解決に活かすことが得意です。そのため、状況や人々を理解するためのパターンやルールを見つけることが上手です。 <br> <br> 
    彼らはとても責任感が強く、与えられた仕事に全力を尽くし、始めたことは最後までやり遂げることに価値を見出します。そのためのタスクは、細かさや組織力を最大限に活かします。定番のルーティンを好み、変化はあまり好ましくないと感じることがあります。 <br><br> <h2>感情表現と頑固さ</h2> 
    しかし、マグロ型の人は、時々感情的ではないと思われることもあります。自分を表現することよりも、義務感を大切にし、感情よりも論理を優先します。これにより、他人からは冷たく、無感情に見えることがあります。 <br><br> さらに、マグロ型の人は頑固な一面も持っています。経験や伝統を大切にするため、新しい考え方や違う視点に対しては抵抗を示すことがあります。
    `,

    strengthsAndWeaknesses: `<h2>マグロ型（ISTJ）のすごいところ</h2>

    <b>一生懸命にやり遂げる：</b> マグロ型の人は、自分が始めたことは絶対にやり遂げるタイプです。困難な問題でもじっくり考えて解決する力があります。<br>
    <br>
    <b>現実的でアクティブ：</b> 夢想よりも現実を大切にし、考えるよりも実際に動くことを好みます。具体的な事実や経験を重んじます。<br>
    <br>
    <b>信頼性が高い：</b> マグロ型の人は、約束を守ることに非常に力を入れます。始めたことは最後まできちんと終わらせることを誇りに思います。<br>
    <br>
    <b>計画的で整理整頓が得意：</b> 何事も計画を立てて行動し、予定通りに物事が進むことを好みます。また、その計画を順番通りにきちんと実行することが得意です。<br>
    <br>
    
    <h2>マグロ型（ISTJ）のちょっと難しいところ</h2>
    
    <b>新しいことに対する抵抗：</b> 慣れた方法やルールを守ることを好み、新しいことにはなかなか挑戦しない傾向があります。これは、未知の状況や変化に対応するのが難しいことを意味します。<br>
    <br>
    <b>感情に対する理解が少ない：</b> マグロ型の人は論理と事実を重視するため、他人の感情に対して理解が少ないことがあります。これは、他人の感情を尊重するのが難しいことを示しています。<br>
    <br>
    <b>批判的になりやすい：</b> 物事を詳細に分析し、完璧を求めるため、自分や他人に対して厳しい批判をすることがあります。これは、失敗やミスに対して過剰に厳しくなることを示しています。<br>
    <br>
    <b>新しいアイデアを出すのが難しい：</b> 現実的で具体的な事実を重視するため、新しいアイデアや抽象的な考え方が得意ではないかもしれません。これは、創造的な解決策を見つけるのが難しいことを意味します。<br>
    `,
    romanticRelationships: `
      マグロ型の人は普段の生活でも恋愛でも、誠実さや信頼性を非常に大切にします。そのため、彼らはパートナーに対して忠実であり、関係を大切にする傾向があります。また、マグロ型の人は恋愛においても規則を尊重し、伝統的な価値観を大切にします。<br><br>

      しかし、感情を表すのが苦手で、それが原因でパートナーに自分の気持ちを理解してもらうのが難しいことがあります。自分の感情を理解し表現するのに時間がかかることが多く、そのためにパートナーが自分の感情を理解して共感してくれると感じられないこともあります。<br><br>

      <h2>感情表現の学習</h2>
      自分の感情を表現することで、パートナーとのコミュニケーションが改善します。これは、感情を言葉で表す練習から始められます。<br><br>
      <h2>パートナーの感情の理解</h2>
      パートナーの感情や必要性を理解し共感することも重要です。パートナーが何を感じ、何が必要なのか理解するために、質問をしたりコミュニケーションスキルを磨くことが有効です。<br><br>
      <h2>伝統から一歩踏み出す勇気</h2>
      伝統的なルールや規範に縛られず、自分の感情やパートナーの感情に対してオープンになることが大切です。これにより、より深い絆や理解を築くことができます。<br><br>
      <h2>パートナーを尊重する心</h2>
      パートナーの価値観や意見、そして感情を尊重することが重要です。これにより、パートナーとの関係を強化し、お互いの理解を深めることができます。<br><br>`,

    friendships: '',
    career: '',
  },
  ISFJ: {
    title: 'ISFJ',
    type: 'トロ',
    image: '/sushi/ISFJ.png',
    compatibleType: [
      {
        title: 'ESFP',
        type: 'ホタテ',
        image: '/sushi/ESFP.png',
        combination: '共感のペア',
        remark: '感情的なコミュニケーションを共有',
        description:
          '感情的に開放的なホタテ型と感情に敏感なトロ型は、感情的なコミュニケーションを通じて深い関係を築くことができます。',
      },
      {
        title: 'INFP',
        type: 'タコ',
        image: '/sushi/INFP.png',
        combination: '理解と共感のペア',
        remark: '深い理解と共感を持つ',
        description:
          '理解力と共感力を持つタコ型と感情的なトロ型は、感情の深さを共有する深い関係性を築くことができます。',
      },
      {
        title: 'ESTJ',
        type: 'アワビ',
        image: '/sushi/ESTJ.png',
        combination: '実行とサポートのバランス',
        remark: '安定性と信頼性を一緒に',
        description:
          '行動的なアワビ型とサポート的なトロ型は、安定性と信頼性を重視したバランスの良い関係を築くことができます。',
      },
      {
        title: 'ENTP',
        type: 'アジ',
        image: '/sushi/ENTP.png',
        combination: '想像力と現実感のペア',
        remark: '新しいアイデアと実用性を共有',
        description:
          '新しいアイデアを持つアジ型と実用的なトロ型は、新しいアイデアとその実用性を理解し、共有することができます。',
      },
      {
        title: 'ENFP',
        type: 'エビ',
        image: '/sushi/ENFP.png',
        combination: '感情と想像力の共有',
        remark: '開放性と理解を一緒に',
        description:
          '開放的なエビ型と理解力のあるトロ型は、感情と想像力の共有を通じて深い関係を築くことができます。',
      },
      {
        title: 'ISFP',
        type: 'イクラ',
        image: '/sushi/ISFP.png',
        combination: '共感と理解のペア',
        remark: '静寂と敏感さを一緒に',
        description:
          '静寂なイクラ型と敏感なトロ型は、共感と理解の共有を通じて、静かで深い関係を築くことができます。',
      },
    ],
    basicPersonality: `
    トロ型の人は通常、深い思いやりと配慮を持ち、他人の感情やニーズに敏感です。これらの特質は、他人を支える役割を果たすのに非常に役立ちます。他人の感情や状況を理解し、自分の行動がどのように他人に影響を及ぼすかを認識する能力が、トロ型の人が人間関係において成功する一因となっています。
    <h2>組織と秩序の重視</h2>
    トロ型の人はまた、組織と秩序を重視します。彼らは事物をスケジュール通りに進め、混乱を避けることを好みます。また、詳細に注意を払い、具体的な事実や情報を記憶し、それらを有効に利用する能力を持っています。
    <h2>自己犠牲的な性質</h2>
    トロ型の人は自己犠牲的で、常に他人のために何ができるかを探求します。自分のニーズを無視して他人のために尽力することがしばしばあります。この特質は、他人からの尊敬を勝ち取る一方で、トロ型の人自身が過労やストレスに陥る可能性もあります。
    <h2>経験からの学習</h2>
    トロ型の人は過去の経験から学び、それを現在の状況に適用することが得意です。新しい状況や未知の体験に対しては慎重な姿勢を持ちます。そのため、変化はしばしば困難なものと感じることがあります。
    <h2>内向的な性格</h2>
    トロ型の人はまた、内向的な性格を持っています。これは、他人との交流よりも、自己の内面の世界に没頭することを好むことを意味します。この内向性は、トロ型の人が自分の感情や思考を他人に表現するのが難しい場合があることを意味します。`,

    strengthsAndWeaknesses: `<h2>トロ型（ISFJ）のすごいところ</h2>

    <b>忍耐力がある：</b> トロ型の人は、一度始めたことを最後まで諦めずにやり続ける力があります。困難なことでも何度でも挑戦を繰り返す心の強さを持っています。<br>
    <br>
    <b>人への思いやり：</b> 他人の気持ちや必要なことにすぐに気付き、サポートや助けを提供することで幸せを感じます。困った時でも、人のためになる行動を忘れません。<br>
    <br>
    <b>細部への注意力：</b> 細かいことにも気を配る力があり、他の人が見落としがちな小さなことでも気づくことができます。これは、他人の感情の理解や問題解決に大いに役立ちます。<br>
    <br>
    <b>高い責任感：</b> 一度引き受けたことは最後までしっかりと果たすことを大切にします。約束を守ることで、他人からの信頼を得ることができます。<br>
    <br>
    
    <h2>トロ型（ISFJ）のちょっと難しいところ</h2>
    
    <b>変化を苦手とする：</b> 慣れ親しんだ生活のリズムやルーチンを好み、急な変化や不確定な状況は避けがちです。新しい環境や状況への対応が難しいかもしれません。<br>
    <br>
    <b>他人を気遣いすぎる：</b> 人の気持ちに敏感すぎて、自分のことよりも他人を優先しすぎることがあります。これは自分自身を犠牲にしてしまい、ストレスや疲れにつながることがあります。<br>
    <br>
    <b>批判に弱い：</b> 他人の意見や評価を深く気にしてしまい、批判や否定的な意見を受けると、自分自身を下に見る傾向があります。<br>
    <br>
    <b>内向的すぎる：</b> 一人の時間を好むあまり、友達と遊ぶ機会を逃したり、新しい経験をするチャンスを失ってしまうことがあります。これは新しい学びの機会を制限してしまうかもしれません。<br>
    `,

    romanticRelationships: `
    トロ型の人は情熱的でありながらもケアフルなパートナーで、恋愛においては忠誠心と献身性を最優先します。感情的なコミュニケーションを重視し、リラックスした環境での愛情表現を好みます。彼らは安定した関係を構築することを望み、細部にまで注意を払い、慈悲深くパートナーのニーズに対応します。
    
    <h2>自己犠牲の傾向</h2>
    しかし、彼らは自己犠牲の傾向があり、他人を幸せにするために自身の感情を抑制することがあります。これは一方でパートナーへの献身的な愛の表現であるものの、自身のニーズや感情が無視される可能性もあります。また、彼らは自分自身の内面を他人に見せることをためらうことがあり、これが深い感情的つながりを構築する際の障壁となることがあります。
    <h2>自己犠牲的な行動への警戒</h2>
    自身の幸せも重要であるということを忘れないようにすることが重要です。自分の感情やニーズを無視すると、長期的には自身とパートナーの双方にとって健康的な関係を維持することが難しくなります。
    <h2>感情のオープン性</h2>
    自分の感情をオープンに表現することに慣れることが重要です。パートナーと深い感情的なつながりを築くためには、自分の感情を素直に表現し、パートナーに理解してもらうことが重要です。
    <h2>パートナーからのフィードバックの受け入れ</h2>
    他人からの批判に敏感であるため、パートナーからのフィードバックを受け入れることが難しいことがあります。しかし、これは関係を強化し、自己成長を促す重要な機会です。パートナーの意見を尊重し、自分の行動を見直すことが重要です。
    <h2>コミュニケーションの重要性</h2>
    パートナーとのコミュニケーションを大切にし、自分の感情や思考を共有することが重要です。また、パートナーの感情や思考を理解し、共感することも同様に重要です。`,
    friendships: '',
    career: '',
  },
  INFJ: {
    title: 'INFJ',
    type: 'ハマチ',
    image: '/sushi/INFJ.png',
    compatibleType: [
      {
        title: 'ENFJ',
        type: 'アナゴ',
        image: '/sushi/ENFJ.png',
        combination: '理想主義者デュオ',
        remark: '親密さと理想を追求',
        description:
          '理想主義者であるアナゴとハマチは、深い親密さと理想を追求する関係性を築くことができます。',
      },
      {
        title: 'INFP',
        type: 'タコ',
        image: '/sushi/INFP.png',
        combination: '共感のカップル',
        remark: '理解と共感が強い',
        description:
          '理解力と共感力を持つタコとハマチは、感情の深さを共有できる深い関係性です。',
      },
      {
        title: 'INTJ',
        type: 'イカ',
        image: '/sushi/INTJ.png',
        combination: '思考と感情のバランス',
        remark: '理論と理想を一緒に',
        description:
          '深い思考を持つイカと感情的なハマチは、理論と理想を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ISFJ',
        type: 'トロ',
        image: '/sushi/ISFJ.png',
        combination: '理解と親密感のペア',
        remark: '深い洞察と共感を持つ',
        description:
          '理解と親密感を追求するトロとハマチは、お互いに深い洞察力と共感力を持つ組み合わせです。',
      },
      {
        title: 'ENFP',
        type: 'エビ',
        image: '/sushi/ENFP.png',
        combination: '活気と共感のペア',
        remark: '楽観性と理解を共有',
        description:
          '活気に満ちたエビとハマチは、楽観性と理解を共有する関係性です。',
      },
      {
        title: 'INFJ',
        type: 'ハマチ',
        image: '/sushi/INFJ.png',
        combination: '優しい哲学者',
        remark: '深い洞察と親密さを追求',
        description:
          '深い洞察力を持つハマチと親密さを追求する関係性を築くことができます。',
      },
      {
        title: 'ISTP',
        type: 'サバ',
        image: '/sushi/ISTP.png',
        combination: '冷静と思いやりのペア',
        remark: '効率性とサポートを共有',
        description:
          '冷静さと思いやりを持つサバとハマチは、効率性とサポートを共有する関係性を築くことができます。',
      },
      {
        title: 'ISTJ',
        type: 'マグロ',
        image: '/sushi/ISTJ.png',
        combination: '信頼と理解のバランス',
        remark: '忠実さと理性を共有',
        description:
          '信頼と理解を追求するマグロとハマチは、忠実さと理性を共有する関係性を築くことができます。',
      },
      {
        title: 'ISFP',
        type: 'イクラ',
        image: '/sushi/ISFP.png',
        combination: '感性と理解のデュオ',
        remark: '感受性と思いやりを持つ',
        description:
          '感受性を持つイクラとハマチは、感性と思いやりを共有する関係性を築くことができます。',
      },
    ],
    basicPersonality: `ハマチ型の人々は非常に理想主義的で、自分自身、他人、そして世界に対して高い期待を寄せています。彼らの理想と価値観は強い動機づけとなり、一貫して自身の信念を追求します。これは妥協を許さず、強烈な信念と熱意をもって物事に取り組むことを意味します。
    <h2>直感的で未来志向</h2>
    ハマチ型の人々は直感を重視し、それが世界の観察と理解の主要な手段となっています。具体的な事実や詳細よりも抽象的な概念や可能性に焦点を当て、これにより未来の可能性を見出し、深い洞察力と創造性を育むことができます。
    <h2>珍しい性格タイプ</h2>
    ハマチ型の人は全人口の約1-2%しか存在しないとされており、MBTIの中でも最も珍しい性格タイプの一つとされています。
    <h2>他人への深い理解</h2>
    感情面では、他人の感情に非常に敏感であり、他人の気持ちやニーズを深く理解する能力を持っています。これは他人のために対策を講じ、困難な状況を解決するのに役立つ特性です。
    <h2>内向的な性格</h2>
    また、ハマチ型の人々は非常に内向的な性格を持っています。自分自身の内面の世界を深く探求することを好み、自分自身の思考や感情について深く反省する時間を必要とします。しかし、この内向性は、自分の感情や思考を他人に表現するのが難しい場合があります。
    <h2>判断的な性格</h2>
    判断的な性質は、ハマチ型の人々が計画性を持ち、一貫性と予測可能性を求めることを示しています。彼らは組織的であり、自分自身の目標を達成するために必要な手順を理解するのが得意です。`,

    strengthsAndWeaknesses: `<h2>ハマチ型（INFJ）のすごいところ</h2>
    <b>深い洞察力：</b> 人や物事の本質を見抜く力があります。他の人が見落としがちなパターンや意味を見つけることができます。<br>
    <br>
    <b>強い理想主義：</b> 自分の理想を信じて、それに向かって一貫して行動する力があります。自分の価値観に基づいて、大切な目標に向かって進むことができます。<br>
    <br>
    <b>人との関係を大切にする：</b> 自分の感情と他人の感情を理解する力があり、これにより人々との深い絆を作ることができます。<br>
    <br>
    <b>創造的な思考：</b> 独自の視点から新しいアイデアを生み出す力があります。これにより、他の人が見つけられない新しい可能性を見つけることができます。<br>
    <br>
    
    <h2>ハマチ型（INFJ）のちょっと難しいところ</h2>
    <b>感じやすい：</b> 他人の意見や批判に強く反応してしまうことがあります。これが原因で、自分を守るために他人から距離を取ってしまうこともあります。<br>
    <br>
    <b>現実から逃げる傾向：</b> 困難な現実から逃れて、理想的な世界を追求してしまうことがあります。これが原因で、現実を見失うことがあります。<br>
    <br>
    <b>プライベートに過敏：</b> 自分を理解し、受け入れてもらうことを強く望んでいますが、自分を他人に開けるのが怖いこともあります。これが原因で、他人との深い関係を作ることが難しくなることがあります。<br>
    <br>
    <b>完璧主義：</b> 自分や他人に対して高い基準を設け、完璧を求める傾向があります。これが原因で、自分自身を厳しく批判したり、他人を厳しく見ることがあります。<br>`,

    romanticRelationships: `彼らは誠実さと深い絆を恋愛関係に重視するパートナーです。敏感さと理想主義を兼ね備えており、パートナーに対して高い理想を抱きつつ、愛情と共感を惜しみなく提供します。
    <h2>思いやりと敏感さ</h2>
    彼らは思いやりが深く、パートナーの感情を読み取り、その需要に応える能力を持っています。しかし、その敏感さは自分自身の感情にも影響を及ぼし、批判や対立を避ける傾向があります。自己の内面世界に深く没入することがあり、時折パートナーを混乱させることがあります。
    <h2>理想と現実のバランスを保つ</h2>
    恋愛関係に高い理想を持つ傾向がありますが、理想と現実の間でバランスを取ることが重要です。理想を追求するあまり現実の関係やパートナーの欠点を見過ごすと、関係が現実の厳しさに直面したときにショックを受ける可能性があります。
    <h2>オープンなコミュニケーション</h2>
    自己表現が得意ではないかもしれませんが、感情や期待を明確に伝えることが重要です。その結果、パートナーとの間に誤解や不満が生じるのを防ぐことができます。
    <h2>自己のニーズを認識する</h2>
    他人の感情やニーズに対する感受性が高いですが、自己のニーズにも注意を向けることが重要です。自己犠牲は短期的には喜びをもたらすかもしれませんが、長期的にはストレスや満足感のなさにつながる可能性があります。
    <h2>自身の価値を認識する</h2>
    他人から価値を見つけることが多いですが、自己価値は他人からではなく自己から生まれることを理解することが重要です。自己を大切にし、自己の幸せを優先することは、自尊心と他人への敬意につながります。`,
    friendships: '',
    career: '',
  },
  INTJ: {
    title: 'INTJ',
    type: 'イカ',
    image: '/sushi/INTJ.png',
    compatibleType: [
      {
        title: 'ENTJ',
        type: 'ウニ',
        image: '/sushi/ENTJ.png',
        combination: '戦略的デュオ',
        remark: '効率と計画を重視',
        description:
          '戦略的で効率的なウニとイカは、計画性と効率性を重視する強力な組み合わせです。',
      },
      {
        title: 'INTP',
        type: 'タマゴ',
        image: '/sushi/INTP.png',
        combination: '知識探求ペア',
        remark: '新たな理論とアイデアを共有',
        description:
          '新たな理論とアイデアを共有できるタマゴとイカは、知識探求を重視する関係性です。',
      },
      {
        title: 'INFJ',
        type: 'ハマチ',
        image: '/sushi/INFJ.png',
        combination: '思考と感情のバランス',
        remark: '理論と理想を一緒に',
        description:
          '深い思考を持つイカと感情的なハマチは、理論と理想を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ISTJ',
        type: 'マグロ',
        image: '/sushi/ISTJ.png',
        combination: '実行戦略ペア',
        remark: '現実とビジョンをバランスよく',
        description: '実行力を持つイカがマグロのビジョンを具現化します。',
      },
      {
        title: 'ENFP',
        type: 'エビ',
        image: '/sushi/ENFP.png',
        combination: '創造的な組み合わせ',
        remark: '自由思考と戦略的思考のバランス',
        description:
          '自由に発想を展開するエビと戦略的に思考するイカは、創造性と戦略性を組み合わせることができます。',
      },
      {
        title: 'ESFJ',
        type: 'サーモン',
        image: '/sushi/ESFJ.png',
        combination: '感情と論理のコラボレーション',
        remark: '感情的配慮と理論的な視点の組み合わせ',
        description:
          '感情的に配慮深いサーモンと理論的な視点を持つイカは、バランスの取れた人間関係を築くことができます。',
      },
      {
        title: 'ENFJ',
        type: 'アナゴ',
        image: '/sushi/ENFJ.png',
        combination: '理想的なパートナーシップ',
        remark: 'ビジョンと共感力を結びつける',
        description:
          '理想を追求するアナゴと洞察力豊かなイカは、共感力とビジョンを結びつけることができます。',
      },
      {
        title: 'ISFJ',
        type: 'トロ',
        image: '/sushi/ISFJ.png',
        combination: '互補的な関係',
        remark: '組織力と洞察力のマッチ',
        description:
          '詳細を重視するトロと全体像を見るイカは、互いに補い合う関係を作り出します。',
      },
    ],
    basicPersonality: `
    イカ型の人は、しばしば「戦略家」または「ビジョナリー」と称されます。彼らは数多くのアイデアを自身の心の中で生み出し、それらを実現するための計画を立てることに長けています。効率的な問題解決を追求し、長期的な目標達成に向けて策略を練ることを好む傾向があります。
    
    <h2>稀有な存在、イカ型の女性</h2>
    イカ型の人々、特に女性は非常にまれで、全人口の約0.8%しか存在しないとされています。INTJの女性は、MBTIの中でも最も稀少な性格タイプの一つと言えます。
    
    <h2>論理と理性を重視</h2>
    彼らは感情よりも論理と理性を重視します。事実に基づいた決定を行い、個人的な価値観や感情よりも客観的な分析を優先します。しかし、この傾向は時として他人から冷淡や無感情と捉えられることがあります。
    
    <h2>内向的で深遠な思考を持つ</h2>
    また、彼らは非常に内向的で、自身の内面の世界に時間を投資することを好みます。深い独立した思考を持ち、自身のアイデアを追求することに情熱を注ぎます。
    
    <h2>完璧主義者の一面</h2>
    さらに、彼らは完璧主義者の傾向があります。自己と他人に対して高い基準を設定し、それを達成するために自己を駆り立てます。これは、自身を成長させるための自己鍛錬を行う一方で、他人に対しても同じく高い期待を持つことを意味します。`,

    strengthsAndWeaknesses: `<h2>イカ型（INTJ）のすごいところ</h2>
    <b>戦略的思考：</b> いつも先を見て計画を立てることが得意です。今の状況から未来の可能性を考えて、それに合わせて行動することができます。<br>
    <br>
    <b>知識が大好き：</b> 新しいことを学ぶのが大好きで、知識を深めることを楽しみます。色んな知識を持っているおかげで、新しい視点や考え方を得ることができます。<br>
    <br>
    <b>自分らしさ：</b> 他人の意見や社会の期待に左右されず、自分の信じることを大切にします。自分の道を自分で切り開くことが好きです。<br>
    <br>
    <b>論理的な判断：</b> 事実や論理を元に考えて、答えを見つけます。情報を客観的に見て、合理的で効果的な解決策を見つけます。<br>
    <br>
    
    <h2>イカ型（INTJ）のちょっと難しいところ</h2>
    <b>感情を理解するのが苦手：</b> 自分や他人の感情を理解するのが難しいことがあります。これが原因で、他人と深い関係を築くのが難しいことがあります。<br>
    <br>
    <b>人と仲良くなるのが難しい：</b> 新しい人と仲良くなるのが難しいことがあります。特に、自分が考える論理と違うことをする人に対して、自分を孤立させてしまうことがあります。<br>
    <br>
    <b>完璧主義：</b> 自分自身にとても高い基準を設け、それが達成できないときに自己批判をしてしまうことがあります。<br>
    <br>
    <b>他人の意見を無視すること：</b> 自分の考えに強く信じているため、他人の意見を見過ごしてしまうことがあります。これが原因で、他人とのコミュニケーションや協力が難しくなることがあります。<br>`,

    romanticRelationships: `
        
    彼らは頭脳が明晰で、独立心が強く、論理的な思考と高い直観力を持っています。恋愛においては、直接的で誠実なコミュニケーションを同時に行い、自己啓発と自己改善を重視します。

    <h2>深い情熱と尊敬の念を抱く</h2>
    彼らは真剣で、自分が関心を持つ人に対しては深い情熱と尊敬の念を抱く傾向があります。しかし、それらの感情を口に出すのは難しいことがあります。そのため、行動や忠誠心を通じて愛情を示すことが多いです。

    <h2>感情の表現を学ぶ</h2>
    彼らは感情的な表現に不慣れなことが多いです。しかし、感情の言葉を見つけ、パートナーと共有することは、関係を深化させ、理解を促進するために重要です。

    <h2>パートナーの感情を尊重する</h2>
    彼らは論理的な思考を重視しますが、パートナーの感情はしばしば論理を超えるものです。相手の感情を無視したり軽視したりせず、その価値と重要性を理解しようとすることが重要です。

    <h2>フレキシビリティを持つ</h2>
    彼らは計画性と一貫性を重視しますが、恋愛は予測不可能で流動的なものです。変化と柔軟性を受け入れ、時には流れに身を任せることが必要です。

    <h2>直接的なコミュニケーション</h2>
    彼らは明確さと率直さを重視します。そのため、間接的なヒントや非言語的なメッセージは彼らにとって難解な場合があります。パートナーとのコミュニケーションでは、具体的で直接的な言葉を用いることが有効です。
    `,
    friendships: '',
    career: '',
  },
  ISTP: {
    title: 'ISTP',
    type: 'サバ',
    image: '/sushi/ISTP.png',
    compatibleType: [
      {
        title: 'ESTP',
        type: 'カニ',
        image: '/sushi/ESTP.png',
        combination: '実践的なデュオ',
        remark: '行動と分析をバランスよく',
        description:
          '実践的で行動的なカニと分析的なサバは、行動と分析のバランスが取れた組み合わせです。',
      },
      {
        title: 'ISTJ',
        type: 'マグロ',
        image: '/sushi/ISTJ.png',
        combination: '論理的なペア',
        remark: '問題解決に集中',
        description:
          '共に論理的思考を好むマグロとサバは、問題解決に重きを置く関係性です。',
      },
      {
        title: 'INTP',
        type: 'タマゴ',
        image: '/sushi/INTP.png',
        combination: '理論的なデュオ',
        remark: '新たな理論とアイデアを共有',
        description:
          '新たな理論とアイデアを共有できるタマゴとサバは、知識探求を重視する関係性です。',
      },
      {
        title: 'ISFP',
        type: 'イクラ',
        image: '/sushi/ISFP.png',
        combination: '感覚と思考のバランス',
        remark: '現実と理論を一緒に',
        description:
          '感覚的で現実的なイクラと思考的なサバは、現実と理論を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ENFP',
        type: 'エビ',
        image: '/sushi/ENFP.png',
        combination: 'エネルギッシュなペア',
        remark: '感情と行動をバランスよく',
        description:
          'エネルギッシュなエビと冷静なサバは、感情と行動をバランス良く組み合わせることができます。',
      },
      {
        title: 'ENTP',
        type: 'アジ',
        image: '/sushi/ENTP.png',
        combination: 'アイデア探求デュオ',
        remark: '挑戦と解析を一緒に',
        description:
          'アイデアに満ち溢れたアジと解析的なサバは、新しい挑戦とその分析を共有できます。',
      },
      {
        title: 'ISFJ',
        type: 'トロ',
        image: '/sushi/ISFJ.png',
        combination: '安定と解析のペア',
        remark: '安定と理論を一緒に',
        description:
          '安定を重視するトロと解析的なサバは、安定と理論を融合させた関係性です。',
      },
      {
        title: 'ESFJ',
        type: 'サーモン',
        image: '/sushi/ESFJ.png',
        combination: '観察と協力のデュオ',
        remark: '外向性と内向性をバランスよく',
        description:
          '協力的なサーモンと観察的なサバは、外向性と内向性をバランス良く組み合わせることができます。',
      },
    ],
    basicPersonality: `
    サバ型の人々は、「職人」タイプとも呼ばれ、手に取るものを分解して理解し、再構築することが得意です。物事の仕組みを理解することに深い喜びを感じ、問題解決の能力が高いことで知られています。

    <h2>'マクガイバー'型とも称される</h2>
    また、サバ型の人々はその実践的なスキルから、「マクガイバー」型とも呼ばれることがあります。これはアメリカの人気シリーズのキャラクター、マクガイバーが何でも利用して問題を解決する手腕を指しています。

    <h2>冷静さを保つ傾向</h2>
    サバ型の人々は、冷静さを保つ傾向があり、高いストレス状況でもパニックにならずに効果的に対応します。客観的な分析者であり、個人的な感情よりも論理と事実に基づいた判断を下すことが多いです。

    <h2>内向的で冒険好き</h2>
    彼らは非常に内向的で、自分自身の内部世界に多くの時間を費やすことを好みます。その一方で、新しい経験を追求し、冒険を楽しむこともあります。しばしばルーティンを避け、新しいアクティビティや趣味を追求することを好む傾向があります。

    <h2>直感的な観察者</h2>
    そして、彼らは直感的な観察者であり、周囲の環境に深く注意を払い、細部まで理解するために必要な情報を吸収します。`,

    strengthsAndWeaknesses: `<h2>サバ型（ISTP）のすごいところ</h2>

    <b>現実的な問題解決：</b> 現実的で具体的な問題解決に長けています。事実と詳細に基づいて、解決策を見つけることが得意です。<br>
    <br>
    <b>自由と柔軟性：</b> 自由を大切にし、規則や制限がないときに最高の働きを見せます。新しい情報や変化にすぐに適応する力があります。<br>
    <br>
    <b>物事を直接扱う力：</b> 物をいじることや分解することが得意です。よく機械やシステムについて自然に理解できます。<br>
    <br>
    <b>冷静さ：</b> プレッシャーがあるときでも冷静さを保つことができます。急に変わる状況にもしっかりと対応します。<br>
    <br>
    
    <h2>サバ型（ISTP）のちょっと難しいところ</h2>
    
    <b>長期計画の苦手さ：</b> 具体的な詳細に集中するため、長期的な計画を考えるのが苦手なことがあります。<br>
    <br>
    <b>感情の理解：</b> 自分自身の感情や他人の感情を理解するのが難しいことがあります。これは人間関係を築くのに問題を生じることがあります。<br>
    <br>
    <b>反規則的：</b> 規則や制約に反発することが多いです。特に規則が複雑だったり、意味がないと感じた場合、周りとの関係に問題を生じることがあります。<br>
    <br>
    <b>他人の意見を無視：</b> 自分の考えや方法に固執する傾向があり、その結果、他人の視点や意見を見過ごすことがあります。<br>`,

    romanticRelationships: `
    理論家や技術者としての性格を持つサバ型の人々は、自分の周りの世界を具体的で論理的な観点から理解するのが得意です。恋愛関係では、これらの特性は彼らを実際的で現実的なパートナーにします。彼らは自己啓発を重視し、新しい経験や知識を求める傾向があります。
    
    <h2>直接的なコミュニケーション</h2>
    通常、彼らは直接的で率直なコミュニケーションを好みますが、自分の感情を開示するのは難しい場合があります。したがって、行動を通じて愛情を示す傾向があります。
    
    <h2>感情の表現を学ぶ</h2>
    論理的な思考に重点を置く傾向があり、感情的な表現には苦手意識を持つことがあります。しかし、自分の感情を認識し、それをパートナーと共有することは、深い理解と接続を促進するために重要です。
    
    <h2>具体性を重視するコミュニケーション</h2>
    率直さと具体性を好むサバ型は、関係の中で期待やニーズを明確に伝えることが重要です。これはパートナーに対する期待についても同様です。
    
    <h2>共有の経験</h2>
    一緒に新しい経験を楽しむことで深いつながりを感じます。共通の趣味や興味を見つけて共有することで、関係は深まります。
    
    <h2>個人の自由と独立</h2>
    自分自身の時間と空間を必要とするサバ型は、パートナーとの深い結びつきを持つ一方で、自由と独立を保つことが重要です。`,
    friendships: '',
    career: '',
  },
  ISFP: {
    title: 'ISFP',
    type: 'イクラ',
    image: '/sushi/ISFP.png',
    compatibleType: [
      {
        title: 'ESFP',
        type: 'ホタテ',
        image: '/sushi/ESFP.png',
        combination: '感情的なデュオ',
        remark: '感情と共感を共有',
        description:
          '感情的で共感力のあるホタテとイクラは、感情と共感を共有する関係性を築くことができます。',
      },
      {
        title: 'ISFJ',
        type: 'トロ',
        image: '/sushi/ISFJ.png',
        combination: '深い共感のペア',
        remark: '理解と感情の共有',
        description:
          '理解力と感情の深さを持つトロとイクラは、感情的な深さを共有できる関係性です。',
      },
      {
        title: 'INTP',
        type: 'タマゴ',
        image: '/sushi/INTP.png',
        combination: '感情と思考のバランス',
        remark: '現実と理論を一緒に',
        description:
          '深い思考を持つタマゴと感情的なイクラは、現実と理論を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ISTP',
        type: 'サバ',
        image: '/sushi/ISTP.png',
        combination: '感覚と思考のバランス',
        remark: '現実と分析を一緒に',
        description:
          '分析的で現実的なサバと感情的なイクラは、現実と分析を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'INFP',
        type: 'タコ',
        image: '/sushi/INFP.png',
        combination: '内向的なデュオ',
        remark: '内省と感情の共有',
        description:
          '内省的なタコと感情的なイクラは、内省と感情を共有できる緊密な関係を築くことができます。',
      },
      {
        title: 'ENFJ',
        type: 'アナゴ',
        image: '/sushi/ENFJ.png',
        combination: '感情的なリーダーとの連携',
        remark: '共感と指導を一緒に',
        description:
          'リーダーシップを持つアナゴと共感的なイクラは、共感と指導を組み合わせた関係を築くことができます。',
      },
      {
        title: 'ESFJ',
        type: 'サーモン',
        image: '/sushi/ESFJ.png',
        combination: '社交的なデュオ',
        remark: '感情の交換と協調',
        description:
          '社交的なサーモンと感情的なイクラは、感情の交換と協調性を重視する関係性を築くことができます。',
      },
      {
        title: 'ESTJ',
        type: 'アワビ',
        image: '/sushi/ESTJ.png',
        combination: '現実的なペア',
        remark: '現実と感情をバランスよく',
        description:
          '実践的で行動的なアワビと感情的なイクラは、現実と感情のバランスが取れた関係性を築くことができます。',
      },
    ],
    basicPersonality: `
    イクラ型の人は「冒険家」や「アーティスト」タイプとも言われ、自分自身と周囲の世界を深く探求し、自己表現のための新たな道を探し続けます。美しさ、調和、そして感情的な感覚を高く評価し、物事を個人的な視点で解釈します。
    
    <h2>芸術的な表現力</h2>
    イクラ型の人々はその感性と表現力から、しばしば多くの著名なアーティストやミュージシャンがこのタイプであると指摘されます。音楽、美術、料理など、どんな形であれ、表現力はしばしば周りの世界に色と活気を加えます。
    
    <h2>感情の共感と尊重</h2>
    また、個々の人々やその感情に対する深い共感を示します。自己表現と個人の価値を尊重し、他人の意見や価値観を認め、尊重します。それは他人を支え、理解し、助けることを自然に得意とすることを意味します。
    
    <h2>内向的な探求心</h2>
    内向的な性格を持っており、自分自身の内面の世界を探求する時間と空間を重視します。その一方で、周囲の世界を観察し、情報を集め、それを自分自身の内面的な経験と結びつける能力があります。
    
    <h2>自由と自発性の追求</h2>
    知覚的な性質は、イクラ型が自由で自発的であることを示しています。スケジュールや計画よりも、瞬間を楽しむことと新しい可能性を探すことを好む傾向があります。
    `,
    strengthsAndWeaknesses: `<h2>イクラ型（ISFP）のすごいところ</h2>
    <b>深い人間関係：</b> 他人と深い絆を築くことが得意です。他人の感情や考え方に対して理解し、支える力を持っています。<br>
    <br>
    <b>現実的な視点：</b> 現実をしっかり見て、事実に基づいた行動をとることができます。問題に対して、現実的な解決策を見つけます。<br>
    <br>
    <b>創造性：</b> 自分だけの視点と新しいアイデアを持っています。色々な状況に対して、自分だけの解決方法を見つけることができます。<br>
    <br>
    <b>柔軟性：</b> 新しい情報や変化に対して開放的で、それに適応することができます。<br>
    <br>
    
    <h2>イクラ型（ISFP）のちょっと難しいところ</h2>
    <b>未来の計画：</b> 今ここに集中することが多く、長い期間の計画や目標を立てるのが苦手なことがあります。<br>
    <br>
    <b>批判に対する敏感さ：</b> 他人からの批判やネガティブな意見に敏感で、それが自分への自信に影響を与えることがあります。<br>
    <br>
    <b>競争：</b> 競争や対立を避けることが多く、それが自分の意見をはっきりと言うことや、必要な時に他人と競うことが難しいことがあります。<br>
    <br>
    <b>意思決定：</b> 感情を大切にするあまり、論理的な最善の答えを見失うことがあります。<br>`,
    romanticRelationships: `
    感情豊かで暖かく、現在の瞬間を最大限に生きることを愛する性格を持っています。彼らは自己表現を重視し、自分の感情をアートや創造性を通じて表現することがよくあります。恋愛関係では、愛情深く、忠実で、思いやりのあるパートナーであり、個々の結びつきを重視します。
    
    <h2>感情の内在化と行動の表現</h2>
    通常、自分の感情を内部に保ち、それらを外部に直接的に表現することは少ないです。しかし、彼らは自分の愛と思いやりを行動として示し、パートナーをケアすることで愛情を表現します。
    
    <h2>感情の表現を学ぶ</h2>
    感情を内部に保つ傾向がありますが、感情を適切に表現し、パートナーと共有することは、互いの理解を深め、結びつきを強化するために重要です。
    
    <h2>創造的なコミュニケーション</h2>
    自分自身を創造的な方法で表現することを好みます。パートナーとの深い結びつきを作るために、アート、音楽、言葉などの創造的な手段を通じて感情を共有することを試みてみてください。
    
    <h2>個人的な空間を尊重する</h2>
    自分自身の時間と空間を大切にします。パートナーとの深い結びつきを持つ一方で、自分自身の独立と自由を尊重することが重要です。
    
    <h2>現在の瞬間を楽しむ</h2>
    現在の瞬間に生きることを好みます。一緒に新しい経験を楽しむことで、関係を深めることができます。
    `,
    friendships: '',
    career: '',
  },
  INFP: {
    title: 'INFP',
    type: 'タコ',
    image: '/sushi/INFP.png',
    compatibleType: [
      {
        title: 'ENFP',
        type: 'エビ',
        image: '/sushi/ENFP.png',
        combination: '理想主義のデュオ',
        remark: '感情と理想を共有',
        description:
          '理想主義で感情豊かなエビとタコは、感情と理想を共有する関係性を築くことができます。',
      },
      {
        title: 'INFJ',
        type: 'ハマチ',
        image: '/sushi/INFJ.png',
        combination: '深い共感のペア',
        remark: '理解と感情の共有',
        description:
          '理解力と感情の深さを持つハマチとタコは、感情的な深さを共有できる関係性です。',
      },
      {
        title: 'INTP',
        type: 'タマゴ',
        image: '/sushi/INTP.png',
        combination: '感情と思考のバランス',
        remark: '現実と理論を一緒に',
        description:
          '深い思考を持つタマゴと感情的なタコは、現実と理論を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ISFP',
        type: 'イクラ',
        image: '/sushi/ISFP.png',
        combination: '感覚と感情のバランス',
        remark: '直感と感情を一緒に',
        description:
          '直感的で感情的なイクラと感情的なタコは、直感と感情を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ENFJ',
        type: 'アナゴ',
        image: '/sushi/ENFJ.png',
        combination: '理想と共感のデュオ',
        remark: '理想と共感を一緒に',
        description:
          '理想主義で共感力のあるアナゴとタコは、理想と共感を組み合わせた良い関係性を築くことができます。',
      },
      {
        title: 'INFP',
        type: 'タコ',
        image: '/sushi/INFP.png',
        combination: '理想主義のペア',
        remark: '理想と理解の共有',
        description:
          '理想主義者であるタコ同士は、理想と理解を共有できる深い関係性を築くことができます。',
      },
      {
        title: 'INTJ',
        type: 'イカ',
        image: '/sushi/INTJ.png',
        combination: '感情と戦略のバランス',
        remark: '感情と計画を一緒に',
        description:
          '戦略的なイカと感情的なタコは、感情と計画を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ISFJ',
        type: 'トロ',
        image: '/sushi/ISFJ.png',
        combination: '感情と現実のバランス',
        remark: '感情と現実を一緒に',
        description:
          '現実的なトロと感情的なタコは、感情と現実を組み合わせたバランスの良い関係性を築くことができます。',
      },
    ],
    basicPersonality: `
    タコ型の人々は「ヒーラー」または「調和を愛する理想家」とも呼ばれ、他人への理解と共感、人間関係の調和、個人的な価値観と信念に対する深いコミットメントを特徴としています。
    
    <h2>創造性と自己表現の追求</h2>
    タコ型の人々はその深い感情と創造性から、多くの著名な作家や詩人がこのタイプであると指摘されています。例えば、ウィリアム・シェイクスピアやJ.R.R. トールキンなどはしばしばINFPとされます。自己表現と自己理解の追求に大きな価値を置きます。自分自身の内面の世界を深く探求し、自己表現のための新たな道を探し続けます。
    
    <h2>共感と理解</h2>
    また、人々とその感情に対する強い共感を持っています。他人の感情を深く理解し、他人の立場を尊重する傾向があります。これは他人を支え、理解し、助けることを自然に得意とすることを意味します。
    
    <h2>フレキシブルかつ開放的</h2>
    知覚的な性質は、タコ型がフレキシブルで開放的であることを示しています。新しい情報や経験に開かれており、状況が変わると自分の視点や計画を適応させることができます。
    `,
    strengthsAndWeaknesses: `<h2>タコ型（INFP）のすごいところ</h2>
    <b>深い感情と共感：</b> 他人の気持ちに深く寄り添えます。それにより、人の感じていることを理解し、適切に対応できます。<br>
    <br>
    <b>独自の創造力：</b> 自分だけの視点と創造的な考えを持っています。新しいアイデアを思いつき、それを実現する方法を見つけることができます。<br>
    <br>
    <b>価値観への忠誠：</b> 自分の価値観に非常に忠実です。自分の価値観に基づいて行動し、その価値観のために立ち上がることがあります。<br>
    <br>
    <b>対人関係の形成：</b> 深くつながった個人的な関係を作るのが得意です。自分を理解し、尊重してくれる人々との関係を求めます。<br>
    <br>
    
    <h2>タコ型（INFP）のちょっと難しいところ</h2>
    <b>実践的な詳細の無視：</b> 大きな視点に集中することが多いため、日々のルーチンや実際の細かい部分を見落とすことがあります。<br>
    <br>
    <b>批判への敏感さ：</b> 自己意識が強いため、批判や否定的な意見に対してとても敏感に反応することがあります。<br>
    <br>
    <b>過度の理想主義：</b> 理想主義者で、現実が自分の理想と合わないときにがっかりすることがあります。<br>
    <br>
    <b>適応性の欠如：</b> 新しい環境や未知の状況に対応するのが苦手な場合があります。自分の落ち着く場所にいることを好みます。<br>`,
    romanticRelationships: `
    感情豊かで暖かく、現在の瞬間を最大限に生きることを愛する性格を持っています。彼らは自己表現を重視し、自分の感情をアートや創造性を通じて表現することがよくあります。恋愛関係では、愛情深く、忠実で、思いやりのあるパートナーであり、個々の結びつきを重視します。
    
    <h2>感情の内部化</h2>
    通常、自分の感情を内部に保ち、それらを外部に直接的に表現することは少ないです。しかし、彼らは自分の愛と思いやりを行動として示し、パートナーをケアすることで愛情を表現します。
    
    <h2>感情の表現を学ぶ</h2>
    感情を内部に保つ傾向がありますが、感情を適切に表現し、パートナーと共有することは、互いの理解を深め、結びつきを強化するために重要です。
    
    <h2>創造的なコミュニケーション</h2>
    自分自身を創造的な方法で表現することを好みます。パートナーとの深い結びつきを作るために、アート、音楽、言葉などの創造的な手段を通じて感情を共有することを試みてみてください。
    
    <h2>個人的な空間を尊重する</h2>
    自分自身の時間と空間を大切にします。パートナーとの深い結びつきを持つ一方で、自分自身の独立と自由を尊重することが重要です。
    
    <h2>現在の瞬間を楽しむ</h2>
    現在の瞬間に生きることを好みます。一緒に新しい経験を楽しむことで、関係を深めることができます。
    
    `,
    friendships: '',
    career: '',
  },
  INTP: {
    title: 'INTP',
    type: 'タマゴ',
    image: '/sushi/INTP.png',
    compatibleType: [
      {
        title: 'ENTP',
        type: 'アジ',
        image: '/sushi/ENTP.png',
        combination: '創造的なデュオ',
        remark: 'アイデアと可能性を共有',
        description:
          '創造的な思考を持つアジと論理的なタマゴは、新しいアイデアと可能性を共有する関係性を築くことができます。',
      },
      {
        title: 'INTJ',
        type: 'イカ',
        image: '/sushi/INTJ.png',
        combination: '深い思考のペア',
        remark: '理論と論理の共有',
        description:
          '深い思考力を持つイカと論理的なタマゴは、理論と論理を共有できる関係性です。',
      },
      {
        title: 'INFP',
        type: 'タコ',
        image: '/sushi/INFP.png',
        combination: '感情と思考のバランス',
        remark: '理論と感情を一緒に',
        description:
          '深い感情を持つタコと論理的なタマゴは、理論と感情を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ISTP',
        type: 'サバ',
        image: '/sushi/ISTP.png',
        combination: '論理と現実感覚のバランス',
        remark: '実践と理論を一緒に',
        description:
          '現実感覚を持つサバと論理的なタマゴは、実践と理論を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ENFJ',
        type: 'アナゴ',
        image: '/sushi/ENFJ.png',
        combination: '洞察と感情の共有',
        remark: '理論と社会性を一緒に',
        description:
          '深い洞察力と社会性を持つアナゴと論理的なタマゴは、理論と社会性を組み合わせた有益な関係を築くことができます。',
      },
      {
        title: 'ISFJ',
        type: 'トロ',
        image: '/sushi/ISFJ.png',
        combination: '思考と感情の調和',
        remark: '現実と理論を一緒に',
        description:
          '現実感覚と感情的なトロと論理的なタマゴは、現実と理論を組み合わせてお互いを補完する関係性を築くことができます。',
      },
      {
        title: 'ESTP',
        type: 'カニ',
        image: '/sushi/ESTP.png',
        combination: '行動と思考のバランス',
        remark: '行動と理論を一緒に',
        description:
          '活動的なカニと論理的なタマゴは、行動と理論を組み合わせたダイナミックな関係性を築くことができます。',
      },
      {
        title: 'ESFJ',
        type: 'サーモン',
        image: '/sushi/ESFJ.png',
        combination: '感情と思考の調和',
        remark: '社会性と理論を一緒に',
        description:
          '社会的で感情的なサーモンと論理的なタマゴは、社会性と理論を組み合わせた対話的な関係性を築くことができます。',
      },
    ],
    basicPersonality: `

    タマゴ型の人は「思考家」や「哲学者」タイプとも呼ばれ、情報を理論的なフレームワークに組み入れ、独自の洞察を得ることを深く楽しみます。また、新しいアイデアと情報に強く引き付けられ、未解決の問題を解決するための新しい方法を見つけることに情熱を燃やします。
    
    <h2>著名なタマゴ型</h2>
    タマゴ型の人々はその抽象的な思考と解析能力から、アインシュタインやダーウィンなどの歴史的な科学者や思想家がこのタイプであるとしばしば指摘されています。
    
    <h2>内向性</h2>
    非常に内向的で、一人でいることを好み、自分自身の内部世界に多くの時間を費やす傾向があります。思考を深め、アイデアを探求し、情報を分析することを楽しむため、独自の空間と時間が必要です。
    
    <h2>直感</h2>
    直感的な性質は、常に新しい可能性を探し、事実や情報を理論的な枠組みに組み込むことを可能にします。これにより、複雑な問題を理解し、新しい解決策を発見するためのユニークな視点を提供します。
    
    <h2>知覚</h2>
    そして、知覚的な性質は、柔軟で開放的であることを示しています。新しい情報や経験に開かれており、スケジュールや計画よりも新しいアイディアや可能性の追求を優先します。
    
    `,
    strengthsAndWeaknesses: `
    <h2>タマゴ型（INTP）のすごいところ</h2>
    <b>論理的思考力：</b> 考えるのが得意で、問題を解決するために情報を論理的に解析し、組み合わせます。そうすることで新しい視点やアイデアを思いつくことができます。<br>
    <br>
    <b>自主性と独立性：</b> 自分の思考と行動に自信があり、自分の道を進むことを好みます。他人とは独立した考え方や行動を大切にします。<br>
    <br>
    <b>創造性：</b> 新しいアイデアや視点を見つけることが好きで、それにより独自の方法で問題を解決することができます。<br>
    <br>
    <b>柔軟性：</b> 新しいアイデアや変化を受け入れることができ、古い考え方や方法に固執することはありません。<br>
    <br>

    <h2>タマゴ型（INTP）のちょっと難しいところ</h2>
    <b>感情の無視：</b> 論理的な思考を大切にするあまり、自分自身や他人の感情を見落とすことがあります。これは人との関係を築く上で問題になることがあります。<br>
    <br>
    <b>実用的な詳細の見落とし：</b> 抽象的な理論やアイデアに興味があるため、日々の生活の細かい部分を見落とすことがあります。<br>
    <br>
    <b>ルールや指示への反発：</b> 自由に考えることを好むため、制約や決まり事に反発することがあります。<br>
    <br>
    <b>自己表現の困難：</b> 自分の思考や感情を言葉にするのが難しい場合があります。これにより、他人とのコミュニケーションをうまく取れないことがあります。<br>


    `,
    romanticRelationships: `

    タマゴ型の人々は非常に独立した思考者であり、恋愛でもその特性が見られます。彼らは恋愛に対して理論的で分析的なアプローチをしがちで、自分自身の感情よりも相手の行動やパターンを理解しようとする傾向があります。直観的で、相手の感情やニーズを素早く理解する能力がありますが、同時に自分自身の感情を表現することは苦手かもしれません。
    
    彼らはまた、独立性と自由を非常に重視します。これは、パートナーがINTPの個々の活動や趣味に対して圧力をかけると、関係が緊張する可能性があることを意味します。新しいアイデアや可能性に興奮しますが、これは日常的なルーチンや一貫性を犠牲にする可能性があります。
    
    <h2>感情を表現する</h2>
    自分の感情を理解し、表現するのが難しい場合があります。感情を正直に表現することで、パートナーとより深い絆を築くことができます。
    
    <h2>パートナーのニーズを尊重する</h2>
    自由と独立性を非常に重視しますが、パートナーが安定感や一貫性を求めている場合、そのニーズを尊重することが重要です。
    
    <h2>パートナーとの時間を大切にする</h2>
    自分の時間と空間を大切にしますが、関係を維持するためにはパートナーとの共有時間も重要です。パートナーとの時間を確保し、その時間を最大限に活用することを忘れないでください。
    
    <h2>日常のルーチンを尊重する</h2>
    新しいアイデアや可能性に興奮しますが、日常のルーチンも大切です。パートナーと共に日常的な活動を楽しむことで、関係が深まることがあります。
    `,
    friendships: '',
    career: '',
  },
  ESTP: {
    title: 'ESTP',
    type: 'カニ',
    image: '/sushi/ESTP.png',
    compatibleType: [
      {
        title: 'ESTJ',
        type: 'アワビ',
        image: '/sushi/ESTJ.png',
        combination: 'エネルギッシュなデュオ',
        remark: '活発さと実践性を共有',
        description:
          '活発な思考を持つアワビとエネルギッシュなカニは、活発さと実践性を共有する関係性を築くことができます。',
      },
      {
        title: 'ESFP',
        type: 'ホタテ',
        image: '/sushi/ESFP.png',
        combination: '社交的なペア',
        remark: '楽しみとエネルギーを共有',
        description:
          '社交的なホタテとエネルギッシュなカニは、楽しみとエネルギーを共有する関係性です。',
      },
      {
        title: 'ISTP',
        type: 'サバ',
        image: '/sushi/ISTP.png',
        combination: '現実感覚と行動力のバランス',
        remark: '即座に行動と現実的な視点を一緒に',
        description:
          '現実感覚を持つサバとエネルギッシュなカニは、即座に行動する能力と現実的な視点を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ISFJ',
        type: 'トロ',
        image: '/sushi/ISFJ.png',
        combination: '安定感とエネルギーのペア',
        remark: '実用性と親密さを持つ',
        description:
          '安定性を追求するトロとエネルギッシュなカニは、実用性と親密さを持つ組み合わせです。',
      },
      {
        title: 'ENFP',
        type: 'エビ',
        image: '/sushi/ENFP.png',
        combination: '楽観的なデュオ',
        remark: 'エネルギーと創造性を共有',
        description:
          '楽観的なエビとエネルギッシュなカニは、エネルギーと創造性を共有する関係性を築くことができます。',
      },
      {
        title: 'ENTJ',
        type: 'ウニ',
        image: '/sushi/ENTJ.png',
        combination: '野心的なペア',
        remark: 'エネルギーと指導力を一緒に',
        description:
          '野心的なウニとエネルギッシュなカニは、エネルギーと指導力を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ESFJ',
        type: 'サーモン',
        image: '/sushi/ESFJ.png',
        combination: '共感力とエネルギーのバランス',
        remark: '共感と行動力を一緒に',
        description:
          '共感力を持つサーモンとエネルギッシュなカニは、共感と行動力を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ENFJ',
        type: 'アナゴ',
        image: '/sushi/ENFJ.png',
        combination: 'カリスマ性とエネルギーのペア',
        remark: '影響力と活発さを持つ',
        description:
          'カリスマ性を追求するアナゴとエネルギッシュなカニは、影響力と活発さを持つ組み合わせです。',
      },
    ],
    basicPersonality: `

    カニ型とは、直感力と問題解決能力を武器に、現実世界をダイナミックに生き抜くタイプです。いつも今を全力で楽しみ、色んな経験を楽しむことが大好きです。
    
    <h2>ハリウッドとスポーツ界のヒーロー</h2>
    
    映画のアクションヒーローやトップスポーツ選手と比較されることも。スーパーマンやマイケル・ジョーダンのような、行動力と調整能力が求められる人々がこのタイプと言われることが多いです。
    
    <h2>社交的なエネルギー充電器</h2>
    
    社交好きで、人と関わることでエネルギーをチャージします。集まりやイベントが大好きで、新しい人との出会いや経験を求めています。
    
    <h2>現実主義者と行動派</h2>
    
    現実をしっかりと見据え、具体的な視点から物事を捉えることが得意です。これにより、現実的な解決策を見つけ、素早く行動に移すことができます。
    
    <h2>直感と論理の公正な裁定者</h2>
    
    感情よりも事実と論理を重視し、直感と論理的思考で公平な判断をします。
    
    <h2>自由と柔軟性を愛する即興マスター</h2>
    
    柔軟性と自由を愛し、計画よりも即興を好むカニ型。新しい情報や経験にすぐに適応する力も持っています。`,

    strengthsAndWeaknesses: `<h2>カニ型（ESTP）のすごいところ</h2>

    <b>実践的な解決策：</b> すぐに問題を解決するための具体的な答えを見つけるのが得意です。現実をしっかりと見て、直面している状況をすぐに理解し、適切な行動をすることができます。<br>
    <br>
    <b>適応力と柔軟性：</b> 変わった状況にもすぐに対応し、新しい状況にもすぐに適応する力があります。困難なことが起きても冷静さを保ち、すぐに行動を起こします。<br>
    <br>
    <b>社交性：</b> 元気で、人との交流を楽しむ性格です。友達との関わりを通じて元気を得て、よくパーティーの中心になります。<br>
    <br>
    <b>直接的なコミュニケーション：</b> はっきりと物を言い、思っていることを率直に伝えます。これにより、友達との間に誤解が生じることを防げます。<br>
    <br>
    
    <h2>カニ型（ESTP）のちょっと難しいところ</h2>
    
    <b>計画性の欠如：</b> その場の楽しさを追い求めやすく、長期的な計画を立てるのが少し苦手なことがあります。<br>
    <br>
    <b>感情の無視：</b> 論理や事実を重視し、感情を無視しがちです。これは友達の感情を傷つけたり、自分自身の感情を無視したりすることがあります。<br>
    <br>
    <b>ルールの無視：</b> 自由を大切にし、束縛や制限をあまり好まない傾向があります。そのため、既存のルールや制度を無視することがあります。<br>
    <br>
    <b>深い関係性の構築の困難：</b> 皮膚的な交流は楽しむものの、深い友情を築くのは苦手な場合があります。自分自身の感情を表現するのも難しいことがあります。<br>`,
    romanticRelationships: `
    カニ型の人々は活発でエネルギッシュ、現実的な人々として知られています。恋愛関係では、彼らは通常、熱心で情熱的なパートナーとなります。現実的な視点と解決策指向の思考を活用して、問題や困難を直面した時に即座に行動に移す能力があります。
    
    <h2>社交的な冒険家として</h2>
    彼らは非常に社交的で、新しい人々や経験を楽しむため、恋愛では冒険的で楽観的なパートナーとなることが多いです。しかし、彼らはしばしば衝動的であり、事前に計画を立てることが苦手であるため、長期的なコミットメントについては慎重さが必要です。
    
    <h2>感情を繋ぐコミュニケーション</h2>
    事実と現実に基づいたコミュニケーションを好むため、感情的な話題には苦手意識を持つことがあります。しかし、恋愛関係では感情の共有と理解が重要であるため、これらのスキルを伸ばすことが有益です。
    
    <h2>冒険と新鮮さを持続する</h2>
    新しい経験と冒険を愛しています。そのため、関係がモノトーンにならないようにすることが大切です。新しい活動や経験を探求することで、関係は新鮮さを保つことができます。
    
    <h2>長期的なビジョンを描く</h2>
    瞬間を生きることを好む傾向がありますが、恋愛関係においては長期的なビジョンと計画が重要になることもあります。パートナーとの将来的な目標や計画について話し合うことで、関係はより強固になるでしょう。
    
    <h2>他人の視点を理解する</h2>
    具体的で現実的な視点を持っていますが、これは他人の視点や感情を理解することが難しくなる可能性があります。パートナーの視点を理解し、受け入れることで、より深い絆と理解を築くことができます。`,
    friendships: '',
    career: '',
  },
  ESFP: {
    title: 'ESFP',
    type: 'ホタテ',
    image: '/sushi/ESFP.png',
    compatibleType: [
      {
        title: 'ESFJ',
        type: 'サーモン',
        image: '/sushi/ESFJ.png',
        combination: '社交的なデュオ',
        remark: '共感とエネルギーを共有',
        description:
          '共感力を持つサーモンとエネルギッシュなホタテは、共感とエネルギーを共有する関係性を築くことができます。',
      },
      {
        title: 'ESTP',
        type: 'カニ',
        image: '/sushi/ESTP.png',
        combination: 'エネルギッシュなペア',
        remark: '活力と活発さを共有',
        description:
          '活発なカニとエネルギッシュなホタテは、活力と活発さを共有する関係性です。',
      },
      {
        title: 'ISFP',
        type: 'イクラ',
        image: '/sushi/ISFP.png',
        combination: '感情とエネルギーのバランス',
        remark: '感情の深さと活気を一緒に',
        description:
          '感情的な深さを持つイクラとエネルギッシュなホタテは、感情の深さと活気を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ISTP',
        type: 'サバ',
        image: '/sushi/ISTP.png',
        combination: 'エネルギーと現実感覚のペア',
        remark: '即座に行動と現実的な視点を持つ',
        description:
          '現実感覚を持つサバとエネルギッシュなホタテは、即座に行動する能力と現実的な視点を持つ組み合わせです。',
      },
      {
        title: 'ENFJ',
        type: 'エビ',
        image: '/sushi/ENFJ.png',
        combination: 'インスピレーションのペア',
        remark: '感情の共有とエネルギー',
        description:
          '共感力を持つエビとエネルギッシュなホタテは、感情を共有し、一緒にエネルギーを広めることができます。',
      },
      {
        title: 'ENFP',
        type: 'タコ',
        image: '/sushi/ENFP.png',
        combination: '創造的なデュオ',
        remark: 'エネルギーと創造性の共有',
        description:
          '創造的なタコとエネルギッシュなホタテは、エネルギーと創造性を共有する関係性です。',
      },
      {
        title: 'ISFJ',
        type: 'トロ',
        image: '/sushi/ISFJ.png',
        combination: '心地よさとエネルギーのバランス',
        remark: '安定感と活発さを一緒に',
        description:
          '安定を提供するトロとエネルギッシュなホタテは、安定感と活発さを一緒に提供することができる関係性を築くことができます。',
      },
      {
        title: 'INFP',
        type: 'ウニ',
        image: '/sushi/INFP.png',
        combination: '感情とエネルギーの共有',
        remark: '感情の深さと活発さを一緒に',
        description:
          '感情的な深さを持つウニとエネルギッシュなホタテは、深い感情と活発さを共有する組み合わせです。',
      },
    ],
    basicPersonality: `
    ホタテ型の人は「パフォーマー」または「エンターテイナー」タイプとも呼ばれ、自分自身を表現するのを愛し、他人とのつながりを深めることに喜びを感じます。また、現実的で、物事を具体的かつ現実的な視点から見ることを好みます。
    <h2>エンターテイナーとしての輝き</h2>
    ホタテ型の人の性格タイプの人々は、その生き生きとしたエネルギーと社交性から、しばしばエンターテイナーやパフォーマー、例えばマリリン・モンローやエルヴィス・プレスリーといった有名人がこのタイプであると指摘されています。
    <h2>社交的なつながりの愛好家</h2>
    
    非常に社交的であり、他人とのコミュニケーションを通じてエネルギーを得ます。他人とつながることを楽しみ、人々の間で起こる動的な相互作用を楽しみます。これは、自然と人々を引きつけ、集団の中心に立つ傾向がある理由の一つです。
    
    <h2>具体的な視点からの物事の見方</h2>
    
    観察的な性質は、具体的で現実的な視点から物事を見ることを示しています。直感よりも観察に頼り、目の前の現実に対処することを好みます。
    
    <h2>感情の共有と理解</h2>
    
    感情的な性質は、個々の感情と価値観を重視し、他人の感情と立場を尊重することを示しています。共感性が高く、他人の感情を理解し、支えることができます。
    <h2>柔軟性と新しい経験の追求</h2>
    知覚的な性質は、フレキシブルで開放的であることを示しています。新しい情報や経験に開かれており、計画やスケジュールよりも新しい経験や機会を追求することを好みます。`,

    strengthsAndWeaknesses: `
    <h2>ホタテ型（ESFP）のすごいところ</h2>

    <b>社交性：</b> 人と関わるのが大好きで、会話を楽しみ、周りの人々を喜ばせるのが得意です。<br>
    <br>
    <b>適応力：</b> とても柔軟で、新しい状況や環境にすぐに対応できます。即座に行動を変える能力があり、流れに乗ることができます。<br>
    <br>
    <b>現実的：</b> 現在の状況に集中し、具体的な事実に基づいて物事を判断するのが得意です。現実的な視点を持ち、細部に注意を払います。<br>
    <br>
    <b>感情的な理解：</b> 他人の感情や気持ちに敏感で、人が何を感じているかを理解するのが上手です。これにより、他人の気持ちに深く共感することができます。<br>
    <br>

    <h2>ホタテ型（ESFP）のちょっと難しいところ</h2>

    <b>長期計画の困難：</b> 瞬間的な体験や楽しみを追求するあまり、長期的な計画や目標を立てるのが難しいことがあります。<br>
    <br>
    <b>感情的な衝動：</b> 感情に流されやすく、感情的な判断をすることがあります。これは時々、行動が不安定になる原因になります。<br>
    <br>
    <b>ルールと制約の無視：</b> 自由と冒険を好むため、ルールや制約を無視することがあります。これにより、規則を守らないことがあるかもしれません。<br>
    <br>
    <b>批判への過敏性：</b> 他人からの批判に敏感で、否定的な意見によって気分が落ち込みやすいです。これは自分自身の評価に影響を与えることがあります。<br>`,
    romanticRelationships: `<h2>ホタテ型パーソナリティ: 外向的で共感的な愛されキャラ</h2>

    ホタテ型の人は外向的で愛されやすく、陽気なパートナーとして知られています。彼らは感情に対して非常に敏感で、他人の気持ちや感情に対する理解が深いため、恋愛関係では非常に共感的で思いやりのあるパートナーとなります。
    
    <h2>瞬間を楽しむエネルギッシュな存在</h2>
    
    彼らはまた、一瞬一瞬を楽しむことを好むため、恋愛ではその瞬間を最大限に楽しむことを重視します。それゆえ、彼らは非常にエネルギッシュで、新しい冒険と経験に常に開放的であることが一般的です。
    
    <h2>現実を見据えつつ</h2>
    
    しかし、彼らは時として衝動的に行動することがあり、長期的な計画やコミットメントについては苦手であることがあります。また、感情的な人間であるため、過度に感情に左右されやすく、問題解決や対立の際には理論的なアプローチよりも感情的なアプローチを取りがちです。
    
    <h2>現実性を忘れずに</h2>
    
    楽しむことを重視し、一瞬一瞬を大切にしますが、それが時として現実から目をそらす結果につながることがあります。長期的な視野を持つこと、問題を直視し、必要な対策を講じることも重要です。
    
    <h2>衝動的な行動を抑える</h2>
    
    衝動的な行動がときどき問題を引き起こすことがあります。感情だけでなく、理論的な思考も取り入れ、行動を計画的にすることを学ぶと良いでしょう。
    
    <h2>他人の視点を尊重する</h2>
    
    他人の感情に対して非常に敏感ですが、それが時として他人の視点や考え方を見過ごすことにつながることがあります。パートナーの視点を尊重し、受け入れることが重要です。
    
    <h2>問題解決スキルを向上させる</h2>
    
    感情的なアプローチを好むため、論理的な思考や問題解決についてはスキルアップが必要かもしれません。パートナーとの対話を通じて、これらのスキルを伸ばしていくことが有益です。`,
    friendships: '',
    career: '',
  },
  ENFP: {
    title: 'ENFP',
    type: 'エビ',
    image: '/sushi/ENFP.png',
    compatibleType: [
      {
        title: 'ENFJ',
        type: 'アナゴ',
        image: '/sushi/ENFJ.png',
        combination: '情熱的なデュオ',
        remark: '相互理解と親密さを追求',
        description:
          '情熱的で理解力のあるアナゴとエビは、相互理解と親密さを追求する関係性を築くことができます。',
      },
      {
        title: 'INFP',
        type: 'タコ',
        image: '/sushi/INFP.png',
        combination: '感情的なペア',
        remark: '感情の深さと情熱を共有',
        description:
          '感情的な深さを持つタコと情熱的なエビは、感情の深さと情熱を共有する関係性です。',
      },
      {
        title: 'INTP',
        type: 'タマゴ',
        image: '/sushi/INTP.png',
        combination: '思考と感情のバランス',
        remark: '深い思考と情熱を一緒に',
        description:
          '深い思考を持つタマゴと情熱的なエビは、深い思考と情熱を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ISFJ',
        type: 'トロ',
        image: '/sushi/ISFJ.png',
        combination: '情熱と親密感のペア',
        remark: '親密さと情熱を追求',
        description:
          '親密さを追求するトロと情熱的なエビは、お互いに親密さと情熱を追求する組み合わせです。',
      },
      {
        title: 'ENTJ',
        type: 'ウニ',
        image: '/sushi/ENTJ.png',
        combination: '情熱的なリーダー',
        remark: '創造性と野心を一緒に',
        description:
          'リーダーシップを発揮するウニと情熱的なエビは、創造性と野心を一緒に追求する関係性を築くことができます。',
      },
      {
        title: 'INTJ',
        type: 'イカ',
        image: '/sushi/INTJ.png',
        combination: '理論と感情のバランス',
        remark: '計画的な思考と情熱を一緒に',
        description:
          '計画的な思考を持つイカと情熱的なエビは、計画的な思考と情熱を一緒に追求する関係性を築くことができます。',
      },
      {
        title: 'ISTJ',
        type: 'マグロ',
        image: '/sushi/ISTJ.png',
        combination: '感情と実用性のペア',
        remark: '情熱と堅実さを組み合わせ',
        description:
          '堅実なマグロと情熱的なエビは、情熱と堅実さを組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ESTJ',
        type: 'アワビ',
        image: '/sushi/ESTJ.png',
        combination: '活力と決断力のペア',
        remark: 'エネルギーと組織性を追求',
        description:
          '組織的なアワビと情熱的なエビは、エネルギーと組織性を追求する組み合わせです。',
      },
    ],
    basicPersonality: `エビ型の人は「活動家」または「キャンペーンダー」タイプとも呼ばれ、新しいアイデアや可能性を探し、他人とつながり、人々を鼓舞することに喜びを感じます。また、社会の変革を望み、他人の生活を改善するために行動を起こすことを得意とします。

    <h2>情熱と想像力の視点</h2>
    エビ型の人々はその情熱的な性格と想像力豊かな視点から、マーク・トウェインやオスカー・ワイルドなどの著名な作家や芸術家がこのタイプであると指摘されています。
    
    <h2>社交的なつながりの追求</h2>
    非常に社交的で、他人との交流を通じてエネルギーを得ます。新しい人々との出会い、新しい経験、新しいアイデアの探求を深く楽しみます。
    
    <h2>創造性と可能性の追求</h2>
    直感的な性格は、新しい可能性やアイデアを追求し、複雑なパターンを見つけ出す能力を示しています。自分自身の内的な世界を探求し、思考を創造的な方法で表現します。
    
    <h2>感情の共有と理解</h2>
    感情的な性格は、個々の価値観と感情を重視し、他人の感情や立場を尊重することを示しています。これにより、共感性が高く、他人と深いつながりを築くことができます。
    
    <h2>柔軟性と新たな可能性の追求</h2>
    最後に、知覚的な性格は、フレキシブルで開放的であることを示しています。新しい情報や経験に開かれており、事前の計画やスケジュールよりも新しいアイディアや可能性の追求を優先します。
    
    `,
    strengthsAndWeaknesses: `<h2>エビ型（ENFP）のすごいところ</h2>

    <b>創造性：</b> 非常に創造的で、新しいアイデアを出すのが得意です。規則に縛られず、自分だけのやり方で問題を解決します。<br>
    <br>
    <b>社交性：</b> 人とつながりを持つのが好きで、他人への理解が深いです。思いやりがあり、他人の視点を理解し、尊重することができます。<br>
    <br>
    <b>熱意：</b> 自分が信じることや興味のあることにとても情熱を持って取り組みます。自分の理想を追求し、他人を巻き込んで共有することができます。<br>
    <br>
    <b>適応性：</b> 新しい状況や変化に対して素早く適応し、予想外の出来事にも柔軟に対応することができます。<br>
    <br>
    
    <h2>エビ型（ENFP）のちょっと難しいところ</h2>
    
    <b>計画性の欠如：</b> 未来の可能性に夢中になりすぎて、今ある状況や日常のルーチンを見逃してしまうことがあります。<br>
    <br>
    <b>過度の感情表現：</b> 感情豊かで、自分の感情を表現するのが得意です。でも、それが時々、他人にとってはちょっと強すぎることもあります。<br>
    <br>
    <b>ストレス耐性の低さ：</b> 感情的な反応が強く、ストレスやネガティブな状況に対して過敏に反応することがあります。<br>
    <br>
    <b>無責任：</b> 新しいアイデアや可能性に夢中になるあまり、約束事や責任を忘れてしまうことがあります。<br>
`,
    romanticRelationships: `

    エビ型の人々は、情熱的で熱心なパートナーで、彼らとの恋愛は滅多に退屈とは言えません。彼らは自己表現に秀でており、意思決定において個人の価値観と感情を大切にします。これらの特性は、深い感情的な絆を形成するための土壌を提供します。
    
    <h2>新たなアイデアと可能性への興奮</h2>
    
    彼らは新しいアイデアと可能性に対して非常に開放的で、通常はパートナーに対しても同じように興奮と熱意を持ちます。そのため、エビ型の人々はよくパートナーを励まし、サポートし、自己成長を推進します。
    
    <h2>感情的な安定性を求める</h2>
    
    しかし、彼らの情熱的な性格は時として過度になり、他人の需要や感情を無視することがあります。また、彼らは非常に感情的な人々であり、それが時として感情的な安定性を欠くことにつながります。
    
    <h2>感情的な安定性を保つ</h2>
    
    感情が高ぶりやすいため、感情的な安定性を維持することが重要です。これは、自己認識と情緒の管理を通じて達成できます。
    
    <h2>他人の需要と感情を尊重する</h2>
    
    情熱的で、自分のアイデアや感情に夢中になることがあります。しかし、これが時として他人の感情や需要を無視することにつながることがあります。パートナーの感情と需要を尊重し、自己中心的な行動を避けることが重要です。
    
    <h2>感情的なコミュニケーションの強化</h2>
    
    感情的な人間であり、時として感情的なコミュニケーションに問題が生じることがあります。感情的なコミュニケーションのスキルを強化することで、これらの問題を克服することができます。
    
    <h2>長期的な視野を持つ</h2>
    
    可能性に満ちた未来に対して非常に興奮していますが、それが時として現実から目をそらすことにつながります。現実を直視し、長期的な計画を立てることも重要です。`,
    friendships: '',
    career: '',
  },
  ENTP: {
    title: 'ENTP',
    type: 'アジ',
    image: '/sushi/ENTP.png',
    compatibleType: [
      {
        title: 'ENFJ',
        type: 'アナゴ',
        image: '/sushi/ENFJ.png',
        combination: '革新的なデュオ',
        remark: 'アイデアと理解力を追求',
        description:
          '理解力のあるアナゴと革新的なアジは、新しいアイデアと深い理解を追求する関係性を築くことができます。',
      },
      {
        title: 'INFP',
        type: 'タコ',
        image: '/sushi/INFP.png',
        combination: '想像力と創造力のペア',
        remark: '創造性と深い感情を共有',
        description:
          '感情の深さを持つタコと創造的なアジは、想像力と創造力を結びつける関係性です。',
      },
      {
        title: 'INTP',
        type: 'タマゴ',
        image: '/sushi/INTP.png',
        combination: '思考とアイデアのバランス',
        remark: '深い思考と創造的なアイデアを一緒に',
        description:
          '深い思考を持つタマゴと創造的なアジは、深い思考と創造的なアイデアを組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ISFJ',
        type: 'トロ',
        image: '/sushi/ISFJ.png',
        combination: '創造性と親密感のペア',
        remark: '親密さと新しいアイデアを追求',
        description:
          '親密さを追求するトロと創造的なアジは、お互いに親密さと新しいアイデアを追求する組み合わせです。',
      },
      {
        title: 'ENTJ',
        type: 'ウニ',
        image: '/sushi/ENTJ.png',
        combination: 'アイデアと行動力のデュオ',
        remark: '革新と実行力を追求',
        description:
          '行動力のあるウニと革新的なアジは、新しいアイデアと実行力を追求する関係性を築くことができます。',
      },
      {
        title: 'ISTP',
        type: 'サバ',
        image: '/sushi/ISTP.png',
        combination: '革新と実践的なペア',
        remark: '新しいアイデアと直感を共有',
        description:
          '実践的なサバと革新的なアジは、新しいアイデアと直感を結びつける関係性です。',
      },
      {
        title: 'ESFJ',
        type: 'サーモン',
        image: '/sushi/ESFJ.png',
        combination: 'アイデアと共感力のバランス',
        remark: '創造性と配慮を一緒に',
        description:
          '共感力を持つサーモンと革新的なアジは、創造性と配慮を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ISFP',
        type: 'イクラ',
        image: '/sushi/ISFP.png',
        combination: '創造性と感受性のペア',
        remark: '感受性と新しいアイデアを追求',
        description:
          '感受性を持つイクラと革新的なアジは、お互いに感受性と新しいアイデアを追求する組み合わせです。',
      },
    ],
    basicPersonality: `アジ型の人は「討論者」または「発明家」タイプとも呼ばれ、新しいアイデアを探求し、既存のシステムに挑戦し、既存のルールを破って新しい可能性を追求することに興奮します。論理的な思考を活用し、問題解決のためにクリエイティブな解決策を見つけ出します。

    <h2>アイデア豊富な思考とコミュニケーションスキル</h2>
    アジ型の人々はそのアイデア豊富な思考とスムーズなコミュニケーションスキルから、しばしば起業家や営業職、作家などの職業に就くことが多いとされています。例えば、トーマス・エジソンやマーク・トウェインはENTP型とされています。
    
    <h2>広範な知識と社交的なエネルギー</h2>
    社交的で、他人との交流を通じてエネルギーを得ます。広範囲の知識と理解を持ち、その情報を他人と共有することで新しいアイデアや視点を得ます。
    
    <h2>新たな可能性を追求する直感と創造性</h2>
    直観的な性質は、新しい可能性やアイデアを追求し、複雑な問題を解決するための独自の方法を見つけることを示しています。抽象的な概念を理解し、その知識を他人と共有することを楽しみます。
    
    <h2>論理的思考と客観的な判断</h2>
    思考的な性質は、論理と理性を重視し、感情よりも客観的な分析に基づいて決定を下すことを示しています。直接的なコミュニケーションを好み、事実に基づいて公正な判断をします。
    
    <h2>柔軟性と新たな経験へのオープンさ</h2>
    知覚的な性格は、フレキシブルで開放的であることを示しています。新しい経験や情報に対して開かれており、その流れに乗ることを好みます。`,
    strengthsAndWeaknesses: `<h2>アジ型（ENTP）のすごいところ</h2>

    <b>創造性：</b> 新しいアイデアを出すのが得意で、新しい可能性や視点を探るのが好きです。問題解決には役立つ力を持っています。<br>
    <br>
    <b>知的好奇心：</b> 学び続けることが好きで、知識を広げることにワクワクします。新しいことを探し続けて、新しいアイデアを理解するのが楽しいです。<br>
    <br>
    <b>対人スキル：</b> 人と話すのが好きで、他の人との関係を築くのが得意です。人々を引きつける力があります。<br>
    <br>
    <b>適応力：</b> 変化に対して素早く適応し、予想外の事態にも上手に対応することができます。<br>
    <br>
    
    <h2>アジ型（ENTP）のちょっと難しいところ</h2>
    
    <b>不注意：</b> 新しいアイデアに頭がいっぱいになると、細かい部分に注意を払うのが難しくなります。詳細を見落とすことがあります。<br>
    <br>
    <b>衝動性：</b> 新しい体験を追求するのが好きで、計画よりも直感に従うことが多いです。これは、衝動的に行動することが多いということです。<br>
    <br>
    <b>焦点の散漫：</b> 色々なことに興味があるため、一つのことに集中するのが難しいことがあります。<br>
    <br>
    <b>不安定：</b> 新しい経験やアイデアを追求するのが好きで、ルーチンや規則が苦手です。これは、時々予測が難しい行動をすることを意味します。<br>
`,
    romanticRelationships: `エビ型の人々は、興奮しやすく、新しいアイデアや可能性に対してオープンな人々であり、これらの特性は彼らの恋愛関係にも反映されます。彼らはパートナーとの間で新鮮なエネルギーを保つことができ、彼らの関係は常に新しい興奮や探索の可能性に満ちています。

    <h2>感情と理性のバランスを取る</h2>
    一方、エビ型の人々はしばしば思考型であり、感情よりも理論や論理に重きを置きます。これは、感情的な誤解やコミュニケーションの問題を引き起こす可能性があります。また、彼らの冒険的な精神と変化への願望は、恋愛関係での不安定さをもたらすことがあります。
    
    <h2>感情的なコミュニケーションを強化する</h2>
    感情よりも理論や論理に重きを置く傾向がありますが、感情的なコミュニケーションは恋愛関係で非常に重要です。感情の表現と理解を深めるためのスキルを強化することが有益です。
    
    <h2>安定性と関係の維持</h2>
    新しいことに対する強い願望を持っていますが、これが時として関係の不安定さにつながることがあります。長期的な視野を持ち、関係の安定性を維持することも重要です。
    
    <h2>パートナーの感情を尊重する</h2>
    思考型であり、時としてパートナーの感情を無視するか過小評価する傾向があります。パートナーの感情を尊重し、理解しようとする努力をすることが重要です。
    
    <h2>コミットメントと責任を持つ</h2>
    自由を愛し、束縛を嫌う傾向がありますが、恋愛関係はコミットメントと責任を必要とします。パートナーへのコミットメントを維持し、信頼関係を築くことが重要です。`,
    friendships: '',
    career: '',
  },
  ESTJ: {
    title: 'ESTJ',
    type: 'アワビ',
    image: '/sushi/ESTJ.png',
    compatibleType: [
      {
        title: 'ENFJ',
        type: 'アナゴ',
        image: '/sushi/ENFJ.png',
        combination: '効果的なリーダーシップ',
        remark: '理解と実用性を追求',
        description:
          '理解力のあるアナゴと実用的なアワビは、共感と実用性を組み合わせた効果的なリーダーシップを築くことができます。',
      },
      {
        title: 'ISTP',
        type: 'サバ',
        image: '/sushi/ISTP.png',
        combination: '論理と実用性のペア',
        remark: '問題解決と効率を共有',
        description:
          '問題解決能力を持つサバと実用的なアワビは、論理と実用性を結びつける強力な組み合わせです。',
      },
      {
        title: 'ISFJ',
        type: 'トロ',
        image: '/sushi/ISFJ.png',
        combination: '頼りがいと忠実さのペア',
        remark: '信念と誠実さを持つ',
        description:
          '忠実なトロと頼りがいのあるアワビは、信念と誠実さを共有する関係性です。',
      },
      {
        title: 'INTJ',
        type: 'イカ',
        image: '/sushi/INTJ.png',
        combination: '戦略的な思考者',
        remark: '戦略と頼りがいを一緒に',
        description:
          '戦略的な思考を持つイカと頼りがいのあるアワビは、実用的な戦略を実行することができる強力な組み合わせです。',
      },
      {
        title: 'ENTP',
        type: 'アジ',
        image: '/sushi/ENTP.png',
        combination: '先導する革新者',
        remark: '新たな視点と実用性を追求',
        description:
          '新しいアイデアの発見者であるアジと実用的なアワビは、新たな視点と実用性を一緒に追求する関係性を築きます。',
      },
      {
        title: 'ESFP',
        type: 'ホタテ',
        image: '/sushi/ESFP.png',
        combination: '活気と実用性のペア',
        remark: 'エネルギーと実行力を共有',
        description:
          'エネルギッシュなホタテと実用的なアワビは、エネルギーと実行力を共有する楽しい関係性です。',
      },
      {
        title: 'ESTP',
        type: 'カニ',
        image: '/sushi/ESTP.png',
        combination: '現実主義者と行動主義者',
        remark: '即時行動と実用性を一緒に',
        description:
          '現実主義者であるカニと実用的なアワビは、即時行動と実用性を一緒に追求する強力な組み合わせです。',
      },
      {
        title: 'ENFP',
        type: 'エビ',
        image: '/sushi/ENFP.png',
        combination: '情熱と組織力のペア',
        remark: 'エネルギーと実用性を共有',
        description:
          '情熱的なエビと実用的なアワビは、エネルギーと実用性を共有する活発な関係性です。',
      },
    ],
    basicPersonality: `アワビ型の人々は「管理者」または「監督者」とも呼ばれ、頼りになり、責任感が強く、伝統を重んじます。構造と規則を尊重し、明確な目標を達成するために論理と実用性を活用します。

    <h2>組織への貢献とコミュニティの一員としての喜び</h2>
    他人との交流を通じてエネルギーを得ます。コミュニティや組織の一部であることを楽しみ、その一員として貢献することに価値を見出します。
    
    <h2>現実的な問題解決と詳細への注意</h2>
    観察的な性質は、現実的で詳細に注意を払い、現実に基づいた情報に対して敏感であることを示しています。直面する課題や問題に対して現実的な解決策を見つける能力を持っています。
    
    <h2>論理と公正性を重んじる思考</h2>
    思考的な性質は、論理と公平性を重視し、情緒よりも客観的な分析に基づいて決定を下すことを示しています。論理的なアプローチを好み、公正かつ合理的な判断を尊重します。
    
    <h2>組織化と計画性の重要性</h2>
    判断的な性格は、組織化され、計画的であることを示しています。一貫性と秩序を重視し、事前に計画を立て、目標を達成することを好みます。`,
    strengthsAndWeaknesses: `<h2>アワビ型（ESTJ）のすごいところ</h2>

    <b>組織化：</b> リーダーとして生まれついての才能があり、物事をまとめ上げることが得意です。人々やプロジェクトを管理し、物事をスムーズに運ぶ力があります。<br>
    <br>
    <b>誠実さ：</b> ルールを守り、真面目に行動することを大切にしています。自分自身や他人に対して高い基準を設定し、公平さと責任感を大事にします。<br>
    <br>
    <b>決断力：</b> 情報を速やかに整理し、すぐに決断を下すことができます。自信をもって物事に挑み、難しい決断も怖がりません。<br>
    <br>
    <b>責任感：</b> 強い責任感を持っており、自分が担当するべきことをしっかりとこなすことを重視します。任務を全うすることに自信と誇りを持っています。<br>
    <br>
    
    <h2>アワビ型（ESTJ）のちょっと難しいところ</h2>
    
    <b>頑固さ：</b> 自分の考え方にこだわりがあり、他人の視点を理解するのが難しいことがあります。自分が正しいと思うと、他人の意見を見過ごすことがあります。<br>
    <br>
    <b>柔軟性の欠如：</b> 慣れ親しんだ順序や規則を好み、予期せぬ変化に対応するのが苦手なときがあります。計画通りに物事を進めることが好きで、思いがけない問題に直面したときは困ることがあります。<br>
    <br>
    <b>無神経さ：</b> はっきりと物事を言う傾向があり、時々他人の感情を傷つけてしまうことがあります。物事を客観的に見ることに重きを置くため、他人の感情やニーズを見落とすことがあります。<br>
    <br>
    <b>過度の重視：</b> 伝統やルールをとても大切にしすぎて、新しいアイデアや創造的な解決策を見過ごすことがあります。<br>`,
    romanticRelationships: `
    アワビ型の人々は責任感が強く、組織化され、実践的で決断力があります。これらの特性は恋愛関係にも影響を及ぼし、関係を順序立て、計画的に進める傾向があります。パートナーに対して誠実で信頼性が高いと見られます。

    <h2>感情的な理解と共感性の重要性</h2>
    感情の理解も重要です。論理的思考に重きを置く傾向があるため、パートナーの感情を理解し、共感することは、より深い絆を築くために重要です。
    
    <h2>柔軟性と他者の視点の尊重</h2>
    柔軟性を持つことも大切です。計画通りに進まない場合や、パートナーの異なる視点や方法に適応する柔軟性を持つことが求められます。また、他者の視点を尊重し、パートナーの意見や感情を認めることも重要です。
    
    <h2>感情的な表現とコミュニケーションの向上</h2>
    感情の言葉にすることが難しいかもしれませんが、恋愛関係では感情的な表現が重要です。自分の感情を言葉にし、パートナーと共有することで、理解と信頼を深めることができます。`,
    friendships: '',
    career: '',
  },
  ESFJ: {
    title: 'ESFJ',
    type: 'サーモン',
    image: '/sushi/ESFJ.png',
    compatibleType: [
      {
        title: 'ENFJ',
        type: 'アナゴ',
        image: '/sushi/ENFJ.png',
        combination: '感情的なサポーター',
        remark: '理解と共感を追求',
        description:
          '理解力のあるアナゴと思いやりのあるサーモンは、共感と理解を深める強い絆を持つことができます。',
      },
      {
        title: 'ISTJ',
        type: 'マグロ',
        image: '/sushi/ISTJ.png',
        combination: '実用と思いやりのペア',
        remark: '頼りがいと支援を共有',
        description:
          '頼りがいのあるマグロと思いやりのあるサーモンは、相互の支援と頼りがいを持つ組み合わせです。',
      },
      {
        title: 'ISFP',
        type: 'イクラ',
        image: '/sushi/ISFP.png',
        combination: '感情的な理解者',
        remark: '心のつながりと共感を持つ',
        description:
          '感情的な理解力を持つイクラと思いやりのあるサーモンは、深い心のつながりと共感を持つ関係性です。',
      },
      {
        title: 'INTP',
        type: 'タマゴ',
        image: '/sushi/INTP.png',
        combination: '思考と感情のバランス',
        remark: '理論と共感を一緒に',
        description:
          '深く考えるタマゴと感情的なサーモンは、理論と共感を組み合わせたバランスの良い関係性を築くことができます。',
      },

      {
        title: 'ENTP',
        type: 'アジ',
        image: '/sushi/ENTP.png',
        combination: '新しいアイデアの追求',
        remark: '創造性と柔軟性を共有',
        description:
          '新しいアイデアの追求者であるアジと思いやりのあるサーモンは、創造性と柔軟性を共有する関係性を築くことができます。',
      },
      {
        title: 'ESTP',
        type: 'アジ',
        image: '/sushi/ESTP.png',
        combination: '行動とサポートのペア',
        remark: '行動力と思いやりを共有',
        description:
          '行動力のあるアジと思いやりのあるサーモンは、行動とサポートを共有する関係性です。',
      },
      {
        title: 'ENFP',
        type: 'エビ',
        image: '/sushi/ENFP.png',
        combination: 'エネルギッシュなペア',
        remark: '活気と思いやりを共有',
        description:
          'エネルギッシュなエビと思いやりのあるサーモンは、活気と思いやりを共有する関係性です。',
      },
    ],
    basicPersonality: `サーモン型の人々は、複雑な問題に取り組むことや挑戦的なパズルを解くことを楽しむ「討論家」または「発明家」として知られています。自己表現に重きを置き、明確な思考を伝えることに優れています。

    <h2>他人との交流と新しいアイデアの追求</h2>
    他人との交流によってエネルギーを得る外向的な性格であり、新しい人々との出会いや新しい環境、アイデアの探求を深く楽しむことが特徴です。
    
    <h2>抽象的なアイデアと深い理解</h2>
    直感的な性質から、抽象的なアイデアや可能性の追求が行われます。物事を多角的に見ることを好み、状況やアイデアに対して深い理解を追求します。
    
    <h2>論理的思考と客観的な視点</h2>
    思考的な性格では、感情よりも論理と分析に重きを置きます。公平で客観的な視点を重視し、論理的な一貫性を好む傾向があります。
    
    <h2>柔軟性と新しい可能性の探求</h2>
    知覚的な性質は、柔軟で開放的な特徴を持っています。新しい情報や経験に対して開かれており、事前の計画やルーティンよりも新しいアイデアや可能性の追求を優先します。

    `,
    strengthsAndWeaknesses: `<h2>サーモン型（ESFJ）のすごいところ</h2>

    <b>協調性：</b> 人とのつながりが大好きで、みんなとのいい関係を保つことを大切にします。他人を思いやり、チームやクラスの調和を保つ努力をします。<br>
    <br>
    <b>献身性：</b> 他人のために何かをすることが好きです。他人の気持ちを理解するのが得意で、思いやりがあり、優しく、寛大な心を持っています。<br>
    <br>
    <b>組織化と実行能力：</b> 物事を計画し、整理し、行動に移すのが得意です。強い責任感があり、目標や仕事を達成するために必要なステップを上手く整理します。<br>
    <br>
    <b>ロイヤルティ：</b> 家族や友人、地域社会に対して非常に忠実です。信頼関係を大切にし、自分が大切に思う人たちや価値観を守ります。<br>
    <br>
    
    <h2>サーモン型（ESFJ）のちょっと難しいところ</h2>
    
    <b>批判への過敏さ：</b> 他人の意見や批判にとても敏感で、自分自身や他人からの批判に強く影響を受けやすいです。他人の意見で自分の価値を決めてしまうことがあります。<br>
    <br>
    <b>押し付けがましさ：</b> 自分の価値観や生活スタイルを他人に押し付けることがあります。自分が正しいと思ったことを強く主張し、他人が違う意見を持っていることを理解するのが難しいです。<br>
    <br>
    <b>過度の依存：</b> 他人の評価や認めてもらうことに依存することがあり、自分の価値を他人の意見で決めてしまうことがあります。<br>
    <br>
    <b>感情的な判断：</b> 感情に流されて物事を判断してしまうことがあり、客観的な視点を見失うことがあります。感情が強く出ることがあり、冷静さを保つのが難しくなることがあります。<br>`,
    romanticRelationships: `サーモン型の人々は社交的で思いやりがあり、他人の幸せを重視する性格です。恋愛関係においても、パートナーへの関心が高く、彼らのニーズに対応することにエネルギーや時間を費やします。この特性は、他者から愛されることへの強い欲求を満たすだけでなく、彼ら自身が幸せを感じるためにも重要です。

    <h2>自己肯定感と他人の視点の理解</h2>
    一方で、サーモン型の人々は他人の承認や評価を強く求める傾向があり、これがストレスを引き起こす可能性があります。また、彼らは自分自身の感情や価値観を他人に押し付ける傾向があるため、対人関係に摩擦を生じさせることもあります。
    
    <h2>自己ケアとオープンなコミュニケーション</h2>
    自己肯定感を高めることや自己の感情やニーズを大切にすることが重要です。他人の視点を理解し尊重することも、パートナーシップのハーモニーを維持するために重要です。また、オープンなコミュニケーションを維持することで、お互いの感情を明示し合い、理解と愛情を深めることができます。`,
    friendships: '',
    career: '',
  },
  ENFJ: {
    title: 'ENFJ',
    type: 'アナゴ',
    image: '/sushi/ENFJ.png',
    compatibleType: [
      {
        title: 'INFJ',
        type: 'ハマチ',
        image: '/sushi/INFJ.png',
        combination: '理想主義者デュオ',
        remark: '親密さと理想を追求',
        description:
          '理想主義者であるハマチとアナゴは、深い親密さと理想を追求する関係性を築くことができます。',
      },
      {
        title: 'ISFP',
        type: 'イクラ',
        image: '/sushi/ISFP.png',
        combination: '感情の理解者',
        remark: '感じる力と理解を共有',
        description:
          '感じる力を持つイクラと理解力のあるアナゴは、相互の感情を理解し、共感する深い絆を持つことができます。',
      },
      {
        title: 'INTP',
        type: 'タマゴ',
        image: '/sushi/INTP.png',
        combination: '理論と感情のバランス',
        remark: '理解と探求を一緒に',
        description:
          '理論を追求するタマゴと感情的なアナゴは、理解と探求のバランスを保つ関係性を築くことができます。',
      },
      {
        title: 'ESTJ',
        type: 'アワビ',
        image: '/sushi/ESTJ.png',
        combination: 'リーダーシップのペア',
        remark: '導きとサポートを共有',
        description:
          'リーダーシップを持つアワビとアナゴは、お互いに導きとサポートを提供し合う関係性です。',
      },

      {
        title: 'ENTP',
        type: 'アジ',
        image: '/sushi/ENTP.png',
        combination: '新しいアイデアの追求',
        remark: '創造性と柔軟性を共有',
        description:
          '新しいアイデアの追求者であるアジとアナゴは、創造性と柔軟性を共有する関係性を築くことができます。',
      },
      {
        title: 'ESTP',
        type: 'カニ',
        image: '/sushi/ESTP.png',
        combination: '行動とサポートのペア',
        remark: '行動力と共感を共有',
        description:
          '行動力のあるカニとアナゴは、行動とサポートを共有する関係性です。',
      },
      {
        title: 'ENFP',
        type: 'エビ',
        image: '/sushi/ENFP.png',
        combination: '活気とサポートのペア',
        remark: '活気と共感を共有',
        description:
          '活気に満ちたエビとアナゴは、活気とサポートを共有する関係性です。',
      },
    ],
    basicPersonality: `アナゴ型の人々は、指導者や教師として知られており、他人の潜在能力を引き出し、コミュニティや組織の一体性と調和を築くことに情熱を注いでいます。彼らは他人のニーズや感情を深く理解し、個々の成長と発展を支援することに喜びを感じます。

    <h2>コミュニケーションと感情的な理解力</h2>
    アナゴ型の人々は他人との交流を通じてエネルギーを得ます。彼らは人々との関わりやコミュニケーションを楽しみ、そのコミュニケーションスキルと感情的な理解力を活用して他人を理解し、支援することができます。
    
    <h2>直感と感情の重視</h2>
    直感的な性格は新しい可能性やアイデアを追求し、複雑なパターンを見つけ出す能力を示しています。彼らは抽象的な概念を理解し、それを他人に教えることが得意です。また、感情的な性格は他人の感情や価値観を重視し、他人の感情や立場を尊重します。これにより、彼らは共感性が高く、他人と深いつながりを築くことができます。
    
    <h2>組織と計画の重要性</h2>
    アナゴ型の人々は組織された計画的な性格であり、一貫性と秩序を重視します。彼らは事前の計画を立て、目標を達成することを好みます。これにより、彼らは組織内でリーダーシップを発揮し、円滑な進行と目標の達成に貢献します。
    `,
    strengthsAndWeaknesses: `<h2>アナゴ型（ENFJ）のすごいところ</h2>

    <b>社交性：</b> 人と関わるのが大好きで、友達作りも得意です。自分のことをしっかりと表現し、みんなとうまく理解し合うことで友達関係をよく保ちます。<br>
    <br>
    <b>共感力：</b> 他人の感情に敏感で、友達の気持ちや考えを理解するのが上手です。友達の立場に立って考え、心から助けたいと思う優しさを持っています。<br>
    <br>
    <b>リーダーシップ：</b> 生まれつきのリーダーで、友達を導いたり、応援したり、励ましたりするのが好きです。自分の夢を持ち、その夢を達成するために友達を一緒に巻き込むのが得意です。<br>
    <br>
    <b>献身的：</b> 他人のために何かをすることが大好きです。自分の時間やエネルギーを使って、友達を助けたり、学校や地域をよくするために頑張ります。<br>
    <br>
    
    <h2>アナゴ型（ENFJ）のちょっと難しいところ</h2>
    
    <b>過度な承認欲求：</b> 他人からの認めてもらうことをとても大切にします。他人の評価で自分の価値を決めてしまうことがあります。<br>
    <br>
    <b>感情的過敏さ：</b> とても感情的で、否定的な意見に対して敏感です。これが自分自身の評価やイメージに影響を与えることがあります。<br>
    <br>
    <b>過剰な献身：</b> 他人のために尽力するのが過ぎると、自分自身のことを忘れてしまったり、疲れてしまうことがあります。<br>
    <br>
    <b>理想化の傾向：</b> 人や物事を理想的に見すぎてしまい、現実を見失うことがあります。これはがっかりしたり、フラストレーションを感じる原因になることがあります。<br>`,
    romanticRelationships: `アナゴ型の人々は情熱的であり、対人関係に深くコミットする傾向があります。彼らはパートナーの感情やニーズを理解し、深い共感を示し、愛する人をサポートし、成長を促進するために全力を尽くすことがよくあります。そのため、彼らは愛情深く、誠実で、献身的なパートナーとして知られています。

    <h2>自己犠牲と自己肯定感の重要性</h2>
    しかし、アナゴ型の人々は自分自身の感情やニーズを無視する傾向があり、これが長期的には自己否定や疲労につながる可能性があります。また、彼らは時折、自分自身や他人に対して過度な期待を持ち、その結果、失望や摩擦を生じることがあります。
    
    <h2>バランスの取れたアプローチ</h2>
    自己の健康や幸福を維持するためには、自分自身のニーズを優先することが重要です。現実的な期待値を持ち、自分自身やパートナー、関係に対して過度な期待を持たないことも重要です。オープンなコミュニケーションを維持し、自分自身の感情やニーズをオープンに伝えることで、パートナーはあなたを理解し、適切なサポートを提供することができます。また、自己肯定感を高めることで、他人からの評価に左右されずに自己価値を認識することができます。
    
    <h2>情熱的なパートナー</h2>
    アナゴ型の人々は情熱と共感のあるパートナーであり、対人関係に深くコミットします。自己犠牲を避けつつ、自己のニーズを優先し、バランスの取れたアプローチを心がけることで、より健全な関係を築くことができます。`,
    friendships: '',
    career: '',
  },
  ENTJ: {
    title: 'ENTJ',
    type: 'ウニ',
    image: '/sushi/ENTJ.png',
    compatibleType: [
      {
        title: 'INTJ',
        type: 'イカ',
        image: '/sushi/INTJ.png',
        combination: '思考型デュオ',
        remark: '論理と戦略を共有',
        description:
          '思考力を持つイカとウニは、論理的な思考と戦略的な視点を共有することができます。',
      },
      {
        title: 'ISTP',
        type: 'サバ',
        image: '/sushi/ISTP.png',
        combination: '現実的なペア',
        remark: '冷静さと効率性を追求',
        description:
          '現実的で冷静なサバと効率的なウニは、互いに冷静さと効率性を重視する関係性を築くことができます。',
      },
      {
        title: 'ESFP',
        type: 'ホタテ',
        image: '/sushi/ESFP.png',
        combination: '行動と指導のバランス',
        remark: '楽観性と指導力を一緒に',
        description:
          '楽観的で行動的なホタテと指導力を持つウニは、楽観性と指導力を組み合わせたバランスの良い関係性を築くことができます。',
      },
      {
        title: 'ISFJ',
        type: 'トロ',
        image: '/sushi/ISFJ.png',
        combination: '保護と導きのペア',
        remark: 'サポートとリーダーシップを共有',
        description:
          '保護とサポートを提供するトロとリーダーシップを持つウニは、お互いにサポートと導きを提供し合う関係性です。',
      },
      {
        title: 'ENFJ',
        type: 'アナゴ',
        image: '/sushi/ENFJ.png',
        combination: '情熱的なリーダーシップ',
        remark: '共感とサポートを追求',
        description:
          '情熱的なリーダーシップを持つアナゴとウニは、共感とサポートを追求する関係性を築くことができます。',
      },
      {
        title: 'ENTP',
        type: 'アジ',
        image: '/sushi/ENTP.png',
        combination: '新しいアイデアの追求',
        remark: '創造性と柔軟性を共有',
        description:
          '新しいアイデアの追求者であるアジとウニは、創造性と柔軟性を共有する関係性を築くことができます。',
      },

      {
        title: 'ENFP',
        type: 'エビ',
        image: '/sushi/ENFP.png',
        combination: '活気とサポートのペア',
        remark: '活気と共感を共有',
        description:
          '活気に満ちたエビとウニは、活気とサポートを共有する関係性です。',
      },
      {
        title: 'ESFJ',
        type: 'サーモン',
        image: '/sushi/ESFJ.png',
        combination: '思いやりのあるケアギバー',
        remark: '思いやりと協力を追求',
        description:
          '思いやりのあるケアギバーであるサーモンとウニは、思いやりと協力を追求する関係性を築くことができます。',
      },
    ],
    basicPersonality: `ウニ型の人々は自己と他人に対して高い基準を持ち、効率的なシステムや戦略を設計して目標を達成します。彼らは直観的で理論的な思考を活用し、問題解決に取り組みます。

    <h2>指導者としての役割</h2>
    ウニ型の人々は戦略的思考と決断力を備えているため、経営者や指導者の役割を果たすことが多いです。スティーブ・ジョブズやネルソン・マンデラなどがENTJ型とされています。
    
    <h2>アイデアの共有とディスカッション</h2>
    他人との交流によってエネルギーを得ることが特徴です。自分のアイデアを他人と共有し、ディスカッションを通じてアイデアを発展させることを好みます。
    
    <h2>抽象的な概念から具体的な戦略へ</h2>
    直感的な性質により、新しい可能性を追求し、アイデアや計画を具体的な戦略に変える能力を持っています。抽象的な概念を理解し、実行可能な道筋を見つけることが得意です。
    
    <h2>論理と客観性に基づく思考</h2>
    思考的な性格は、論理と理性を重視し、情緒よりも客観的な分析に基づいた判断をすることを示しています。公平性と公正さを尊重し、一貫性と論理的な一貫性を重視します。
    
    <h2>組織化と計画性</h2>
    ウニ型の人々は計画的で、明確な計画とスケジュールを作成し、目標を効率的に達成します。
    
    `,
    strengthsAndWeaknesses: `<h2>ウニ型（ENTJ）のすごいところ</h2>

    <b>リーダーシップ：</b> 生まれながらのリーダーで、友達をまとめたり、指導したりするのが得意です。自分のことをしっかりと信じており、自分の考えをはっきりと伝えることができます。<br>
    <br>
    <b>戦略的思考：</b> 複雑な問題やアイデアを理解し、将来の目標に向けた計画を立てるのが得意です。新しいアイデアを出して問題を解決したり、ものごとを改善するのが上手です。<br>
    <br>
    <b>決断力：</b> 早くて効率的な決定を下すことができます。事実に基づいて考えて行動し、スピーディーに前に進むことを好みます。<br>
    <br>
    <b>強い意志：</b> 非常に目標に向かって進む力が強く、自分が立てた計画を達成するためには強い意志と決断力を発揮します。困難なことにもしっかりと立ち向かうパワーを持っています。<br>
    <br>
    
    <h2>ウニ型（ENTJ）のちょっと難しいところ</h2>
    
    <b>無感情：</b> 論理的な考えや客観性を大切にし、感情や感じたことをあまり重視しない傾向があります。これは、友達の感情を理解したり、共感するのが少し難しいこともあります。<br>
    <br>
    <b>頑固：</b> 自分の考えに自信を持つあまり、友達の意見を聞かなかったり、新しいアイデアに対して開かれていないことがあります。<br>
    <br>
    <b>無慈悲：</b> 結果や効率を最優先し、友達との関係や他人の感情を二の次にすることがあります。これは、友達からちょっと冷たいと思われることがあります。<br>
    <br>
    <b>過剰な競争心：</b> 強い競争心を持つため、友達と協力するよりも競争を好む傾向があります。これは、友達との関係を難しくする可能性があります。<br>
    `,
    romanticRelationships: `ウニ型の人々は自然なリーダーであり、計画的で目標志向的な傾向を持っています。恋愛においても、彼らのパートナーとの関係管理方法にその特性が現れます。彼らは順調な進展を好み、堅実な計画と一貫性を重視します。また、直接的なコミュニケーションを好み、それがパートナーとの信頼関係を深める手段だと信じています。
    <h2>感情の理解と表現</h2>
    感情の理解と表現に苦労することがありますが、これは克服可能な挑戦です。自分自身の感情を深く理解し、適切に表現する方法を学ぶことは、人間関係を大いに改善するでしょう。
    
    <h2>他人の視点を理解する</h2>
    自己主張が強く、自分の視点を優先する傾向があります。しかし、パートナーの視点を理解し尊重することは、健全な関係を維持するために重要です。
    
    <h2>柔軟性を持つ</h2>
    計画を立て実行することを好む一方、すべてが計画通りに進まないこともあると理解することが重要です。適応性と柔軟性を持つことは、生活の不確実性を扱う上で不可欠です。
    
    <h2>感謝と認識の表現</h2>
    自分が望む結果に焦点を当てる傾向があり、既に達成したことやパートナーの貢献を見落とすことがあります。定期的に感謝の意を表し、パートナーの価値を認識することは、関係を強化します。`,
    friendships: '',
    career: '',
  },
};
